{
  "common": {
    "name": "energiefluss-erweitert",
    "version": "0.7.3",
    "news": {
      "0.7.3": {
        "en": "FIX: Only the first icon could be changed. After that, no icons were shown in the list\nFIX: On first load, datasources are not inserted in alphabetical order\nFIX: If a copied element belongs to a group, the group was not removed from that element\nFIX: Element positions (fore- and background) were not saved/displayed properly\nFIX: If an element should open a frame/site, an error was shown that no datasource is assigned\nAdded: ACE SearchBox for Styles tab, output log and overrides (Strg + F)",
        "de": "FIX: Nur das erste Icon konnte geändert werden. Danach wurden keine Symbole in der Liste angezeigt\nFIX: Beim ersten Laden werden Datenquellen nicht in alphabetischer Reihenfolge eingefügt\nFIX: Wenn ein kopiertes Element zu einer Gruppe gehört, wurde die Gruppe nicht von diesem Element entfernt\nFIX: Elementpositionen (Vor- und Hintergrund) wurden nicht richtig gespeichert/gespielt\nFIX: Sollte ein Element einen Frame/site öffnen, wurde ein Fehler gezeigt, dass keine Datenquelle zugewiesen ist\nHinzugefügt: ACE SearchBox for Styles Tab, Ausgabelog und Overrides (Strg + F)",
        "ru": "FIX: Изменить можно только первый значок. После этого иконы в списке не показывали\nFIX: При первой загрузке источники данных не вставляются в алфавитном порядке\nЕсли скопированный элемент принадлежит группе, группа не была удалена из этого элемента\nFIX: Позиции элементов (впереди и в фоновом режиме) не были сохранены/отображаются должным образом\nFIX: Если элемент должен открыть кадр/сайт, была показана ошибка, что источник данных не назначен\nДобавлено: вкладка ACE SearchBox for Styles, журнал вывода и надстройки (Strg + F)",
        "pt": "FIX: Apenas o primeiro ícone poderia ser alterado. Depois disso, nenhum ícone foi mostrado na lista\nFIX: Na primeira carga, as fontes de dados não são inseridas em ordem alfabética\nFIX: Se um elemento copiado pertence a um grupo, o grupo não foi removido desse elemento\nCORREÇÃO: As posições dos elementos (ante e fundo) não foram salvas/exibidas corretamente\nFIX: Se um elemento deve abrir um frame/site, um erro foi mostrado que nenhum datasource é atribuído\nAdicionado: ACE SearchBox for Styles tab, saída log e overrides (Strg + F)",
        "nl": "FIX: Alleen het eerste pictogram kon worden gewijzigd. Daarna werden geen pictogrammen meer getoond in de lijst\nFIX: Bij eerste lading worden de gegevensbronnen niet in alfabetische volgorde ingevoegd\nFIX: Als een gekopieerd element tot een groep behoort, is de groep niet uit dat element verwijderd\nFIX: Elementposities (voor- en achtergrond) zijn niet correct opgeslagen/afgespeeld\nFIX: Als een element een frame/site moet openen, is een fout aangetoond dat er geen gegevensbron is toegewezen\nToegevoegd: ACE SearchBox voor Styles tabblad, output log en overrides (Strg + F)",
        "fr": "FIX : Seule la première icône a pu être modifiée. Après cela, aucune icône n'a été affichée dans la liste\nFIX: Lors de la première charge, les sources de données ne sont pas insérées par ordre alphabétique\nFIX : Si un élément copié appartient à un groupe, le groupe n'a pas été supprimé de cet élément\nFIX : Les positions de l'élément (avant et arrière-plan) n'ont pas été sauvegardées ou affichées correctement\nFIX: Si un élément doit ouvrir un frame/site, une erreur a été montrée qu'aucune source de données n'est attribuée\nAjouté: ACE SearchBox pour l'onglet Styles, log de sortie et les rebords (Strg + F)",
        "it": "FIX: Solo la prima icona potrebbe essere cambiata. Dopo di che, nessuna icona è stata mostrata nella lista\nFIX: Al primo carico, le risorse di dati non sono inserite in ordine alfabetico\nFIX: Se un elemento copiato appartiene ad un gruppo, il gruppo non è stato rimosso da quell'elemento\nFIX: Le posizioni degli elementi (prima e sfondo) non sono state salvate/ visualizzate correttamente\nFIX: Se un elemento dovesse aprire un frame/sito, è stato mostrato un errore che non viene assegnata nessuna fonte di dati\nAggiunto: ACE SearchBox for Styles tab, output log and overrides (Strg + F)",
        "es": "FIX: Sólo el primer icono podría cambiarse. Después de eso, no se mostraron iconos en la lista\nFIX: En primera carga, los códigos de datos no se insertan en orden alfabético\nFIX: Si un elemento copiado pertenece a un grupo, el grupo no fue eliminado de ese elemento\nFIX: Las posiciones de elementos (antes y de fondo) no fueron guardadas o reproducidas correctamente\nFIX: Si un elemento debe abrir un marco/sitio, se demostró un error que no se asigna ningún fuente de datos\nAñadido: ACE SearchBox for Styles tab, log de salida y overrides (Strg + F)",
        "pl": "FIX: Tylko pierwsza ikona mogła zostać zmieniona. Po tym, nie było ikon na liście\nFIX: Przy pierwszym załadowaniu dane nie są wstawiane w porządku alfabetycznym\nFIX: Jeśli skopiowany element należy do grupy, grupa nie została usunięta z tego elementu\nFIX: Pozycje elementów (przed- i tło) nie zostały prawidłowo zapisane / wyświetlone\nFIX: Jeśli element powinien otworzyć ramę / stronę, został pokazany błąd, że nie przypisano danych\nDodano: ACE SearchBox for Styles tab, output log and overrides (Strg + F)",
        "uk": "FIX: Тільки перша ікона може бути змінена. Після цього в списку відсутні ікони\nFIX: На першому навантаженні джерела даних не вставляються в алфавітному порядку\nFIX: Якщо скопійований елемент належить до групи, група не знімалася з цього елемента\nFIX: Настанови елементу (для- і фону) не були збережені/показані належним чином\nFIX: Якщо елемент повинен відкрити кадр/сайт, помилка була показана, що немає джерела даних\nДодано: ACE SearchBox для вкладок стилів, вихідний журнал та перенаряддя (Strg + F)",
        "zh-cn": "FIX:只有第一个图标可以更改. 之后,列表中没有显示图标\nFIX:在第一次加载时,数据源不按字母顺序插入\nFIX: 如果复制的元素属于一个组, 该组没有从该元素中删除\nFIX: 元素位置( 前和背景) 保存/显示不当\nFIX: 如果元素打开帧/ 站点, 显示错误, 没有指定数据源\n添加: ACE SearchBox for Styles tab, 输出日志和覆盖( Strg + F)"
      },
      "0.7.2": {
        "en": "FIX: Object browser was not opening, if objects do not have proper language details\nFIX: Datasources table actions column was misaligned\nAdded: Dependencies updated (Admin: >=7.4.10 is now required) (#344)\nAdded: Browser-Frame can now be an ioBroker state. This can be text, html, numbers or even a jsonTable, which will be displayed inside an overlay (new window or same window don't work for this)\nAdded: Some language corrections",
        "de": "FIX: Objekt-Browser wurde nicht geöffnet, wenn Objekte keine richtigen Sprachdetails haben\nFIX: Datenquellentabellenaktionen Spalte wurde falsch ausgerichtet\nHinzugefügt: Dependancen aktualisiert (Admin: >=7.4.10 ist jetzt erforderlich) (#344)\nHinzugefügt: Browser-Frame kann jetzt ein ioBroker Zustand sein. Dies kann Text, HTML, Zahlen oder sogar eine jsonTable sein, die innerhalb einer Overlay angezeigt wird (neues Fenster oder gleiches Fenster funktioniert nicht dafür)\nHinzugefügt: Einige Sprachkorrekturen",
        "ru": "FIX: браузер объектов не открывается, если объекты не имеют соответствующих языковых деталей\nFIX: столбец действий таблицы данных был смещен\nДобавлено: Обновленные зависимости (Админ: >=7.4.10 теперь требуется) (#344)\nBrowser-Frame теперь может быть состоянием ioBroker. Это может быть текст, html, цифры или даже jsonTable, который будет отображаться внутри наложения (новое окно или то же окно не работает для этого)\nДобавлено: Некоторые языковые исправления",
        "pt": "FIX: O navegador objeto não estava abrindo, se os objetos não têm detalhes de idioma adequados\nCORREÇÃO: A coluna de ações da tabela de datasources foi desalinhada\nAdicionado: Dependências atualizadas (Admin: >=7.4.10 é agora necessário) (#344)\nAdicionado: Browser-Frame pode agora ser um estado ioBroker. Isso pode ser texto, html, números ou até mesmo um jsonTable, que será exibido dentro de uma sobreposição (nova janela ou mesma janela não funcionam para isso)\nAdicionado: Algumas correções de idioma",
        "nl": "FIX: Object browser werd niet geopend, als objecten niet de juiste taal details hebben\nFIX: De kolom Acties van de gegevensbronnentabel is onjuist ingesteld\nToegevoegd: Bijgewerkte afhankelijkheden (Admin: < 7.4.10 is nu vereist) (#344)\nToegevoegd: Browser-Frame kan nu een ioBroker toestand zijn. Dit kan tekst, html, nummers of zelfs een jsonTable zijn, die in een overlay wordt weergegeven (nieuw venster of hetzelfde venster werkt hier niet voor)\nToegevoegd: Enkele taalcorrecties",
        "fr": "FIX: Le navigateur objet n'ouvrait pas, si les objets n'ont pas les détails de langue appropriés\nFIX: La colonne Actions du tableau des sources de données a été mal alignée\nAjouté : Mise à jour des dépendances (l'administrateur : >=7.4.10 est maintenant requis) (#344)\nAjouté: Browser-Frame peut maintenant être un état ioBroker. Il peut s'agir de texte, de html, de nombres ou même d'une table json, qui sera affichée à l'intérieur d'une superposition (la nouvelle fenêtre ou la même fenêtre ne fonctionne pas pour cela)\nAjouté : quelques corrections linguistiques",
        "it": "FIX: Il browser degli oggetti non è stato aperto, se gli oggetti non hanno i dettagli della lingua corretta\nFIX: La colonna delle azioni della tabella delle risorse dati è stata disallineata\nAggiunto: Dipendenze aggiornate (Admin: >=7.4.10 è ora richiesto) (#344)\nAggiunto: Browser-Frame può ora essere uno stato ioBroker. Questo può essere testo, html, numeri o anche un jsonTable, che verrà visualizzato all'interno di un overlay (la nuova finestra o la stessa finestra non funzionano per questo)\nAggiunto: Alcune correzioni linguistiche",
        "es": "FIX: El navegador de objetos no estaba abriendo, si los objetos no tienen detalles de lenguaje adecuados\nFIX: Datasources table actions column was misaligned\nAñadido: Dependencies updated (Admin: ±=7.4.10 is now required) (#344)\nAñadido: Browser-Frame ahora puede ser un estado ioBroker. Esto puede ser texto, html, números o incluso un jsonTable, que se mostrará dentro de un overlay (nueva ventana o misma ventana no funcionan para esto)\nAñadido: Algunas correcciones de idiomas",
        "pl": "FIX: Przeglądarka obiektów nie otwierała się, jeśli obiekty nie posiadają odpowiednich danych językowych\nFIX: Kolumna działań w tabeli danych została źle dostosowana\nDodano: Aktualizacja zależności (Admin: > = 7.4.10 jest teraz wymagana) (# 344)\nDodano: Browser- Frame może teraz być stanem jOBroker. Może to być tekst, html, numery lub nawet jsonTable, które będą wyświetlane wewnątrz nakładki (nowe okno lub to samo okno nie działają na to)\nDodano: Niektóre korekty językowe",
        "uk": "FIX: Об'єктний браузер не відкрився, якщо об'єкти не мають належної інформації\nFIX: Datasources таблиці дій стовпець був вирівняний\nДодано: Залежності оновлено (Admin: >=7.4.10 тепер потрібно) (#344)\nДодано: браузер-Frame тепер може бути іоБрокерним станом. Це може бути текст, HTML, номери або навіть jsonTable, який буде відображатися всередині накладної (нове вікно або вікно не працює для цього)\nДоданий: Деякі мовні виправлення",
        "zh-cn": "FIX: 对象浏览器没有打开, 如果对象没有适当的语言细节\nFIX: 数据源表格动作栏对齐错误\n加: 更新的依赖性(目前需要++7.4.10)(# 344)\n添加:浏览器-Frame现在可以是一个ioBroker状态. 这可以是文本, html, 数字甚至一个 jsonTable , 这将显示在一个覆盖层中( 新窗口或同一窗口对此不起作用 )\n添加:一些语言更正"
      },
      "0.7.1": {
        "en": "FIX: If datasource element was modified, the current status was not fetched correctely\nFIX: Overrides for elements were not applied correctly (#340)\nFIX: Filter in selection gallery was not working\nFIX: After tour has been visited, \"End\" didnt take the user to the overview\nAdded: If you use the internal Icon-Proxy, icons are now cached inside the browser for faster loading and flicker prevention, if you use them in overrides\nAdded: While sorting in Datasources table was set to descending, the new added datasource was sorted in wrongly\nAdded: Improved loading and filter time of the ioBroker object browser\nAdded: Object browser now supports smoother filtering including complete states (e.g. 0_userdata.0.example_state)\nAdded: Some code optimizations under the hood for smoother runtime\nAdded: Better information, why an element could not be deleted (e.g. existing connection)\nAdded: Few language corrections",
        "de": "FIX: Wurde das Datenquellenelement geändert, wurde der aktuelle Status nicht korrekt abgeholt\nFIX: Overrides für Elemente wurden nicht korrekt angewendet (#340)\nFIX: Filter in der Auswahlgalerie nicht funktioniert\nFIX: Nachdem die Tour besucht wurde, nahm \"End\" den Benutzer nicht zur Übersicht\nHinzugefügt: Wenn Sie die interne Icon-Proxy verwenden, werden Icons jetzt im Browser für schnelleres Laden und Flimmern vorbeugt, wenn Sie sie in Overrides verwenden\nHinzugefügt: Beim Sortieren in Datasources-Tabelle wurde zum Absteigen gesetzt, die neue hinzugefügte Datenquelle wurde falsch sortiert\nHinzugefügt: Verbesserte Lade- und Filterzeit des ioBroker-Objekt-Browsers\nHinzugefügt: Objekt-Browser unterstützt nun die reibungslosere Filterung inklusive kompletter Zustände (z.B. 0_userdata.0.example_state)\nHinzugefügt: Einige Code-Optimierungen unter der Haube für glattere Laufzeit\nHinzugefügt: Bessere Informationen, warum ein Element nicht gelöscht werden konnte (z.B. bestehende Verbindung)\nHinzugefügt: Nur wenige Sprachkorrekturen",
        "ru": "FIX: Если элемент источника данных был изменен, текущий статус не был получен корректно\nFIX: Переопределения для элементов были применены неправильно (#340)\nFIX: Фильтр в галерее отбора не работает\nFIX: После посещения тура «Конец» не привел пользователя к обзору\nДобавлено: Если вы используете внутренний Icon-Proxy, значки теперь кэшируются внутри браузера для более быстрой загрузки и предотвращения мерцания, если вы используете их в перезагрузках\nВ то время как сортировка в таблице Datasources была настроена на снижение, новый добавленный источник данных был отсортирован неправильно\nДобавлено: Улучшенная загрузка и время фильтрации объекта браузера ioBroker\nДобавлено: Объектный браузер теперь поддерживает более плавную фильтрацию, включая полные состояния (например, 0_userdata.0.example_state)\nДобавлено: Некоторые оптимизации кода под капотом для более плавного выполнения\nУлучшенная информация, почему элемент не может быть удален (например, существующее соединение)\nДобавлено: Несколько языковых исправлений",
        "pt": "FIX: Se o elemento datasource foi modificado, o status atual não foi buscado corretamente\nFIX: As sobreposições para elementos não foram aplicadas corretamente (#340)\nFIX: Filtro na galeria de seleção não estava funcionando\nFIX: Depois que a turnê foi visitada, \"End\" não levou o usuário para a visão geral\nAdicionado: Se você usar o Icon-Proxy interno, os ícones agora estão em cache dentro do navegador para carregamento mais rápido e prevenção de cintilação, se você usá-los em substituições\nAdicionado: Ao classificar em Datasources tabela foi definido para descer, o novo datasource adicionado foi classificado em incorretamente\nAdicionado: Melhorado o tempo de carregamento e filtro do navegador objeto ioBroker\nAdicionado: O navegador de objetos agora suporta filtragem mais suave, incluindo estados completos (por exemplo, 0_userdata.0.example_state)\nAdicionado: Algumas otimizações de código sob o capuz para tempo de execução mais suave\nAdicionado: Melhor informação, por que um elemento não poderia ser excluído (por exemplo, conexão existente)\nAdicionado: Poucas correções de idioma",
        "nl": "FIX: Als het gegevensbronelement is gewijzigd, is de huidige status niet correct opgehaald\nFIX: Overschrijven voor elementen werden niet correct toegepast (#340)\nFIX: Filter in selectiegalerij werkte niet\nFIX: Nadat de tour is bezocht, nam \"End\" de gebruiker niet mee naar het overzicht\nToegevoegd: Als u de interne Icon-Proxy gebruikt, worden de pictogrammen nu gecached in de browser voor sneller laden en flikkeren preventie, als u ze gebruikt in overrides\nToegevoegd: Tijdens het sorteren in Datasources tabel was ingesteld op aflopen, de nieuwe toegevoegde datasource werd ten onrechte gesorteerd\nToegevoegd: Verbeterde laad- en filtertijd van de ioBroker objectbrowser\nToegevoegd: Object browser ondersteunt nu gladder filteren inclusief complete toestanden (bijv. 0_userdata.0.example_state)\nToegevoegd: Sommige code optimalisaties onder de kap voor een vlottere runtime\nToegevoegd: Betere informatie, waarom een element niet verwijderd kon worden (bv. bestaande verbinding)\nToegevoegd: Weinig taalcorrecties",
        "fr": "FIX : Si l'élément datasource a été modifié, l'état actuel n'a pas été récupéré correctement\nFIX: Les dépassements pour les éléments n'ont pas été appliqués correctement (#340)\nFIX: Filtre dans la galerie de sélection ne fonctionnait pas\nFIX: Après la visite, \"End\" n'a pas amené l'utilisateur à l'aperçu\nAjouté: Si vous utilisez l'Icon-Proxy interne, les icônes sont maintenant mises en cache à l'intérieur du navigateur pour un chargement plus rapide et la prévention du scintillement, si vous les utilisez dans les cas de dépassements\nAjouté : Lors du tri dans le tableau Datasources a été réglé à la descente, la nouvelle source de données ajoutée a été triée à tort\nAjouté : Temps de chargement et de filtrage amélioré du navigateur objet ioBroker\nAjouté : Le navigateur objet prend désormais en charge le filtrage plus lisse, y compris les états complets (par exemple 0_userdata.0.exemple_state)\nAjouté: Quelques optimisations de code sous le capot pour un fonctionnement plus fluide\nAjout : meilleure information, raison pour laquelle un élément n'a pas pu être supprimé (par exemple connexion existante)\nAjouté : quelques corrections linguistiques",
        "it": "FIX: Se l'elemento datasource è stato modificato, lo stato attuale non è stato recuperato correttamente\nFIX: Gli overrides per gli elementi non sono stati applicati correttamente (#340)\nFIX: Il filtro nella galleria di selezione non funzionava\nFIX: Dopo aver visitato il tour, \"End\" non ha portato l'utente alla panoramica\nAggiunto: Se si utilizza il Icon-Proxy interno, le icone sono ora cached all'interno del browser per il caricamento più veloce e la prevenzione flicker, se li si utilizza in overrides\nAggiunto: Mentre la selezione in Datasources tabella è stato impostato per scendere, la nuova datasource aggiunto è stato ordinato in modo errato\nAggiunto: Migliorato il tempo di caricamento e filtro del browser oggetto ioBroker\nAggiunto: Object browser now support smoother filtering compreso stati completi (ad esempio 0_userdata.0.example_state)\nAggiunto: Alcune ottimizzazioni di codice sotto il cofano per runtime più liscia\nAggiunto: Migliore informazione, perché un elemento non potrebbe essere cancellato (ad esempio connessione esistente)\nAggiunto: Poche correzioni di lingua",
        "es": "FIX: Si se modificó el elemento fuente de datos, el estado actual no fue alcanzado correctamente\nFIX: Las anulaciones para elementos no se aplicaron correctamente (#340)\nFIX: Filtro en la galería de selección no estaba funcionando\nFIX: Después de la visita, \"End\" no llevó al usuario a la vista general\nAñadido: Si utilizas el Icon-Proxy interno, los iconos están ahora encamados dentro del navegador para una carga más rápida y la prevención del parpadeo, si los usas en overrides\nAñadido: Mientras que la clasificación en la tabla Datasources se estableció para descender, el nuevo fuente de datos añadido fue clasificado incorrectamente\nAñadido: Tiempo de carga y filtro mejorados del navegador de objetos de ioBroker\nAñadido: El navegador de objetos ahora admite filtrado más suave incluyendo estados completos (por ejemplo 0_userdata.0.example_state)\nAñadido: Algunas optimizaciones de código bajo la capucha para un tiempo de funcionamiento más suave\nAñadido: Mejor información, por qué no se puede eliminar un elemento (por ejemplo, conexión existente)\nAñadido: Pocas correcciones de idiomas",
        "pl": "FIX: Jeśli element danych został zmodyfikowany, obecny status nie został poprawnie pobrany\nFIX: Przekroczenia dla elementów nie zostały prawidłowo zastosowane (# 340)\nFIX: Filtr w galerii wyboru nie działał\nFIX: Po zwiedzeniu trasy, \"End\" nie zabrał użytkownika do przeglądu\nDodano: Jeśli używasz wewnętrznego Icon- Proxy, ikony są teraz buforowane wewnątrz przeglądarki dla szybszego ładowania i zapobiegania migotaniu, jeśli używasz ich w przekroczeniach\nDodano: Podczas gdy sortowanie w tabeli Datassure było ustawione na malejącą, nowe dodane dane zostały posortowane w niewłaściwy sposób\nDodano: Ulepszony czas ładowania i filtrowania przeglądarki obiektów jOBroker\nDodano: przeglądarka obiektów obsługuje teraz płynniejsze filtrowanie, w tym kompletne stany (np. 0 _ userdata.0.example _ state)\nDodano: Niektóre optymalizacje kodu pod maską dla płynniejszego czasu biegania\nDodano: Lepsze informacje, dlaczego element nie mógł zostać usunięty (np. istniejące połączenie)\nDodano: Kilka poprawek językowych",
        "uk": "FIX: Якщо було змінено елемент джерела даних, поточний статус не було виправлено\nFIX: Надміри для елементів не застосовуються правильно (#340)\nFIX: Фільтр в галереї вибору не працює\nFIX: Після того, як тур побував, \"Енд\" не взяв користувача на огляд\nДоданий: Якщо ви використовуєте внутрішню ікону-Проксі, іконки тепер закупорюють всередині браузера для швидкого завантаження і запобігання мерехтіння, якщо ви використовуєте їх на Overrides\nДодано: Під час сортування в таблиці Datasources було встановлено, щоб нащадок, новий доданий джерело даних був відсортований неправильно\nДодано: Покращений час завантаження та фільтрування браузера об'єкта ioBroker\nДодано: Об'єктний браузер тепер підтримує плавлення фільтрування, включаючи повні стани (наприклад, 0_userdata.0.example_state)\nДодано: Деякі оптимізації коду під капюшоном для розгладжування\nДодано: Краще інформацію, чому елемент не може бути видалений (наприклад, існуюче підключення)\nДодано: Корекції мови Few",
        "zh-cn": "FIX: 如果数据源元素被修改, 当前状态没有被正确获取 \nFIX: 未正确应用元素覆盖(# 340)\nFIX: 选择库中的过滤器无效\nFIX:巡演过后,\"结束\"没有带用户看概览\n添加: 如果您使用内部的图标- Proxy, 图标现在被缓存到浏览器内部, 用于更快的加载和闪烁预防, 如果您在覆盖时使用它们\n添加: 数据源表格的排序被设定为降级, 而新添加的数据源排序错误\n添加: 改进 ioBroker 对象浏览器的加载和过滤时间\n添加: 对象浏览器现在支持包括完整状态( 如 0_ userdata. 0. example_ state) 在内的更平滑的过滤\n添加: 在引擎盖下进行一些代码优化, 用于更平滑的运行时间\n添加: 更好的信息, 为什么无法删除元素( 如已有连接) \n添加:语言更正很少"
      },
      "0.7.0": {
        "en": "FIX: If a line reconnection is aborted, the initial selected line was unselected\nFIX: Workspace could not be re-sized under some circumstances\nFIX: Leaving workspace open, sometimes results in adding the same datasources again and again\nFIX: If the used WebView on devices is too old, the live-view could not be displayed (#292, #324)\nFIX: Overwrites with javascript functions could be falsy detected as datapoint {my.0.datapoint}\nFIX: Gallery did not show the last uploaded image directly, if uploading several images at once\nAdded: Dependencies updated (Web-Adapter: 6.1.10 and Admin: 6.0.0 are now required) (#332)\nAdded: Inside the images select dialog uploads are possible\nAdded: Pictures can now be rotated\nAdded: If a value is set to be animated while changing the value, a visual effect is added to indicate the change\nAdded: Undo und Redo functions are now globally availabe\nAdded: If elements of the same type are selected, the user is able to perform modifications on them in one step (stack actions)\nAdded: Strg/Meta (Mac) + A now selects all elements except lines\nAdded: Copied elements can now be inserted at the current pointer position\nAdded: Holding down the Shift key enables 2 modes: 1. moving elements with the keyboard, 10 steps per key press are possible | 2. moving elements with the mouse, the element snaps in the next grid\nAdded: Password protection for workspace. Password can be set inside the adapter-settings!\nAdded: An URL parameter \"lang=en\" can now be attached to the URL, to display the live view and configuration workspace in the defined language\nAdded: UI optimizations",
        "de": "FIX: Wenn eine Zeilenumschaltung abgebrochen wird, wurde die erste ausgewählte Zeile nicht ausgewählt\nFIX: Workspace konnte unter Umständen nicht neu dimensioniert werden\nFIX: Arbeitsraum öffnen zu lassen, führt manchmal dazu, die gleichen Datenquellen immer wieder hinzuzufügen\nFIX: Wenn der verwendete WebView auf Geräten zu alt ist, konnte die Live-Ansicht nicht angezeigt werden (#292, #324)\nFIX: Überschreiben mit Javascript-Funktionen könnten gefälscht als Datenpunkt erkannt werden {my.0.datapoint}\nFIX: Galerie hat das letzte hochgeladene Bild nicht direkt angezeigt, wenn mehrere Bilder gleichzeitig hochgeladen werden\nHinzugefügt: Dependencies aktualisiert (Web-Adapter: 6.1.10 und Admin: 6.0.0 sind jetzt erforderlich) (#332)\nHinzugefügt: Innerhalb der Bilder Auswahl Dialog Uploads sind möglich\nHinzugefügt: Bilder können jetzt gedreht werden\nHinzugefügt: Wird ein Wert beim Wechsel des Wertes animiert, wird ein visueller Effekt hinzugefügt, um die Änderung anzuzeigen\nHinzugefügt: Undo und Redo-Funktionen sind jetzt weltweit availabe\nHinzugefügt: Wenn Elemente der gleichen Art ausgewählt werden, kann der Benutzer in einem Schritt Änderungen an ihnen durchführen (Stack-Aktionen)\nHinzugefügt: Strg/Meta (Mac) + A wählt nun alle Elemente außer Linien\nHinzugefügt: Copied-Elemente können nun an der aktuellen Zeigerposition eingefügt werden\nHinzugefügt: Halten Sie die Schalttaste ermöglicht 2 Modi: 1. bewegliche Elemente mit der Tastatur, 10 Schritte pro Tastenpresse sind möglich | 2. bewegte Elemente mit der Maus, das Element schnappt im nächsten Raster\nHinzugefügt: Passwort-Schutz für Workspace. Passwort kann innerhalb der Adaptereinstellungen eingestellt werden!\nHinzugefügt: Ein URL-Parameter \"lang=en\" kann nun an der URL angebracht werden, um den Live-View- und Konfigurations-Workspace in der definierten Sprache anzuzeigen\nHinzugefügt: UI-Optimierungen",
        "ru": "FIX: Если пересоединение линии прерывается, выбранная строка не была выбрана\nFIX: Рабочее пространство не может быть изменено при определенных обстоятельствах\nОставляя рабочее пространство открытым, иногда приводит к добавлению одних и тех же источников данных снова и снова\nЕсли используемый WebView на устройствах слишком стар, он не может отображаться (#292, #324)\nFIX: перезапись с функциями JavaScript может быть ошибочно обнаружена как точка данных {my.0.datapoint}\nFIX: Галерея не показывала последнее загруженное изображение напрямую, если загружалось сразу несколько изображений\nОбновленные зависимости (Web-Adapter: 6.1.10 и Admin: 6.0.0 теперь необходимы) (#332)\nДобавлено: Внутри изображений можно выбрать диалоговые загрузки\nДобавлено: Фотографии теперь можно повернуть\nДобавлено: Если значение устанавливается для анимации при изменении значения, визуальный эффект добавляется для указания изменения\nФункции Undo и Redo теперь глобально доступны\nЕсли выбраны элементы одного и того же типа, пользователь может выполнить изменения на них за один шаг (стековые действия)\nДобавлено: Strg/Meta (Mac) + A теперь выбирает все элементы, кроме линий\nДобавлено: Скопированные элементы теперь можно вставить в текущее положение указателя\nДобавлено: Удержание клавиши Shift включает 2 режима: 1. движущиеся элементы с клавиатурой, 10 шагов на нажатие клавиш возможны | 2. движущиеся элементы с мышью, элемент щелкает в следующей сетке\nДобавлено: Защита паролей для рабочего пространства. Пароль может быть установлен внутри настроек адаптера!\nДобавлено: параметр URL «lang=en» теперь может быть прикреплен к URL, чтобы отображать рабочее пространство просмотра в реальном времени и конфигурации на определенном языке\nДобавлено: UI оптимизация",
        "pt": "FIX: Se uma reconexão de linha for abortada, a linha selecionada inicial não foi selecionada\nFIX: O espaço de trabalho não poderia ser redimensionado em algumas circunstâncias\nFIX: Deixando espaço de trabalho aberto, às vezes resulta em adicionar os mesmos datasources repetidamente\nFIX: Se o WebView usado em dispositivos é muito velho, a visualização ao vivo não pode ser exibida (#292, #324)\nFIX: Overwrites with javascript functions could be falsy detect as datapoint {my.0.datapoint}\nFIX: Galeria não mostrou a última imagem carregada diretamente, se carregar várias imagens ao mesmo tempo\nAdicionado: Dependências atualizadas (Web-Adapter: 6.1.10 e Admin: 6.0.0 agora são necessárias) (#332)\nAdicionado: Dentro das imagens selecione uploads de diálogo são possíveis\nAdicionado: Fotos podem agora ser giradas\nAdicionado: Se um valor é definido para ser animado ao alterar o valor, um efeito visual é adicionado para indicar a mudança\nAdicionado: Undo und Redo funções são agora globalmente valeabe\nAdicionado: Se os elementos do mesmo tipo são selecionados, o usuário é capaz de executar modificações neles em um passo (ações de jogo)\nAdicionado: Strg/Meta (Mac) + A agora seleciona todos os elementos exceto linhas\nAdicionado: Os elementos copied agora podem ser inseridos na posição do ponteiro atual\nAdicionado: Segurando a tecla Shift permite 2 modos: 1. movendo elementos com o teclado, 10 passos por tecla imprensa são possíveis | 2. movendo elementos com o mouse, o elemento se encaixa na próxima grade\nAdicionado: Proteção de senha para workspace. A senha pode ser definida dentro das configurações do adaptador!\nAdicionado: Um parâmetro URL \"lang=en\" agora pode ser anexado à URL, para exibir a visualização ao vivo e espaço de trabalho de configuração no idioma definido\nAdicionado: UI optimizations",
        "nl": "FIX: Als een regelherverbinding wordt afgebroken, is de initiële geselecteerde regel niet geselecteerd\nFIX: Werkruimte kon onder bepaalde omstandigheden niet worden aangepast\nFIX: werkruimte open laten, resulteert soms in het opnieuw en opnieuw toevoegen van dezelfde databronnen\nFIX: Als de gebruikte WebView op apparaten te oud is, kan de live-view niet getoond worden (#292, #324)\nFIX: Overschrijven met javascript functies kan vals worden gedetecteerd als datapoint {my.0.datapoint}\nFIX: Galerij heeft de laatst geüploade afbeelding niet direct weergegeven, als meerdere afbeeldingen tegelijk worden geüpload\nToegevoegd: Afhankelijkheden bijgewerkt (Web-Adapter: 6.1.10 en Admin: 6.0.0 zijn nu vereist) (#332)\nToegevoegd: In de afbeeldingen selecteer dialoog uploads zijn mogelijk\nToegevoegd: Foto's kunnen nu gedraaid worden\nToegevoegd: Als een waarde is ingesteld om geanimeerd te worden tijdens het veranderen van de waarde, wordt een visueel effect toegevoegd om de verandering aan te geven\nToegevoegd: ongedaan maken und opnieuw functies zijn nu wereldwijd beschikbaar\nToegevoegd: Als elementen van hetzelfde type zijn geselecteerd, kan de gebruiker er in één stap wijzigingen op uitvoeren (stackacties)\nToegevoegd: Strg/Meta (Mac) + A selecteert nu alle elementen behalve regels\nToegevoegd: gekopieerde elementen kunnen nu op de huidige pointerpositie worden ingevoegd\nToegevoegd: Het vasthouden van de Shift-toets maakt 2 modi mogelijk: 1. bewegende elementen met het toetsenbord, 10 stappen per druk op de toetsen zijn mogelijk 2. bewegende elementen met de muis, het element snapt in het volgende raster\nToegevoegd: Wachtwoordbeveiliging voor werkruimte. Wachtwoord kan ingesteld worden binnen de adapterinstellingen!\nToegevoegd: Een URL parameter \"lang=en\" kan nu worden gekoppeld aan de URL, om de live weergave en configuratie werkruimte in de gedefinieerde taal weer te geven\nToegevoegd: UI optimalisaties",
        "fr": "FIX : Si une reconnexion de ligne est annulée, la ligne initiale sélectionnée n'a pas été sélectionnée\nFIX: L'espace de travail n'a pas pu être redimensionné dans certaines circonstances\nFIX : Le fait de laisser l'espace de travail ouvert entraîne parfois l'ajout des mêmes sources de données encore et encore\nFIX: Si le WebView utilisé sur les appareils est trop vieux, la vue en direct ne peut pas être affichée (#292, #324)\nFIX: Les écrasements avec les fonctions javascript peuvent être détectés en tant que datapoint {my.0.datapoint}\nFIX: Galerie n'a pas montré la dernière image téléchargée directement, si télécharger plusieurs images à la fois\nAjouté: Dépendances mises à jour (Web-Adapter: 6.1.10 et Admin: 6.0.0 sont maintenant nécessaires) (#332)\nAjouté : Dans la boîte de dialogue de sélection des images, les téléchargements sont possibles\nAjouté: Les images peuvent maintenant être tournées\nAjouté: Si une valeur est définie pour être animée tout en changeant la valeur, un effet visuel est ajouté pour indiquer le changement\nAjouté : Les fonctions Undo und Redo sont désormais disponibles dans le monde entier\nAjouté : Si des éléments du même type sont sélectionnés, l'utilisateur est en mesure d'effectuer des modifications sur eux en une seule étape (actions de sauvegarde)\nAjouté : Strg/Meta (Mac) + A sélectionne désormais tous les éléments sauf les lignes\nAjouté: Les éléments copiés peuvent maintenant être insérés à la position actuelle du pointeur\nAjout : Le maintien de la touche Maj permet 2 modes : 1. éléments mobiles avec le clavier, 10 étapes par touche presse sont possibles\nAjouté: Protection par mot de passe pour l'espace de travail. Le mot de passe peut être réglé à l'intérieur des réglages de l'adaptateur !\nAjouté : Un paramètre URL \"lang=fr\" peut maintenant être attaché à l'URL, pour afficher l'espace de travail de la vue en direct et de la configuration dans la langue définie\nAjouté : optimisations de l'interface utilisateur",
        "it": "FIX: Se una riga di ricollegamento viene annullata, la linea selezionata iniziale non è stata selezionata\nFIX: Lo spazio di lavoro non potrebbe essere ridimensionato in alcune circostanze\nFIX: Lasciare spazio di lavoro aperto, a volte si traduce nell'aggiunta delle stesse risorse di dati ancora e ancora\nFIX: Se il WebView utilizzato sui dispositivi è troppo vecchio, la vista dal vivo non potrebbe essere visualizzata (#292, #324)\nFIX: Le sovrascritture con funzioni javascript potrebbero essere rilevate come datapoint {my.0.datapoint}\nFIX: Gallery non ha mostrato l'ultima immagine caricata direttamente, se caricare diverse immagini contemporaneamente\nAggiunto: Dipendenze aggiornate (Web-Adapter: 6.1.10 e Admin: 6.0.0 sono ora necessari) (#332)\nAggiunto: All'interno delle immagini selezionare i upload di dialogo sono possibili\nAggiunto: Pictures può ora essere ruotato\nAggiunto: Se un valore è impostato per essere animato mentre cambia il valore, viene aggiunto un effetto visivo per indicare il cambiamento\nAggiunto: Undo und Redo funzioni sono ora globalmente availabe\nAggiunto: Se gli elementi dello stesso tipo sono selezionati, l'utente è in grado di eseguire modifiche su di loro in un passo (stack action)\nAggiunto: Strg/Meta (Mac) + A ora seleziona tutti gli elementi tranne le linee\nAggiunto: Elementi accoppiati possono ora essere inseriti alla posizione attuale puntatore\nAggiunto: Holding down the Shift key abilita 2 modalità: 1. elementi in movimento con la tastiera, 10 passi per la pressa chiave sono possibili | 2. elementi in movimento con il mouse, l'elemento scatta nella griglia successiva\nAggiunto: Protezione password per spazio di lavoro. La password può essere impostata all'interno delle impostazioni dell'adattatore!\nAggiunto: Un parametro URL \"lang=en\" può ora essere allegato all'URL, per visualizzare il live view e lo spazio di lavoro di configurazione nella lingua definita\nAggiunto: UI ottimizzazioni",
        "es": "FIX: Si se aborta una reconexión de línea, la línea inicial seleccionada no fue seleccionada\nFIX: El espacio de trabajo no puede ser redimensionado en algunas circunstancias\nFIX: Dejar el espacio de trabajo abierto, a veces resulta en agregar los mismos fuente de datos una y otra vez\nFIX: Si el WebView usado en dispositivos es demasiado viejo, la vista en vivo no se puede mostrar (#292, #324)\nFIX: Las sobreescrituras con funciones de javascript podrían ser falsas detectadas como punto de datos {my.0.datapoint}\nFIX: Gallery no mostró la última imagen subida directamente, si subía varias imágenes a la vez\nAñadido: Dependencies updated (Web-Adapter: 6.1.10 y Admin: 6.0.0 are now required) (#332)\nAñadido: Dentro de las imágenes se pueden seleccionar las subidas de diálogo\nAñadido: Las imágenes pueden ser rotadas\nAñadido: Si se establece un valor para ser animado al cambiar el valor, se añade un efecto visual para indicar el cambio\nAñadido: Deshacer las funciones de Redo nod ahora están disponibles globalmente\nAñadido: Si se seleccionan elementos del mismo tipo, el usuario puede realizar modificaciones en ellos en un solo paso (actuaciones de personal)\nAñadido: Strg/Meta (Mac) + A ahora selecciona todos los elementos excepto las líneas\nAñadido: Los elementos copiados se pueden insertar ahora en la posición puntero actual\nAñadido: Mantener la tecla Shift permite 2 modos: 1. elementos móviles con el teclado, 10 pasos por la prensa clave son posibles Ø 2. elementos móviles con el ratón, el elemento se rompe en la siguiente cuadrícula\nAñadido: Protección de contraseña para el espacio de trabajo. La contraseña se puede configurar dentro de los ajustes de adaptador!\nAñadido: Un parámetro URL \"lang=en\" ahora se puede adjuntar a la URL, para mostrar la vista en vivo y el espacio de trabajo de configuración en el idioma definido\nAñadido: Optimizaciones UI",
        "pl": "FIX: W przypadku przerwania połączenia z linią, wybrana linia nie została wybrana\nFIX: Przestrzeń robocza nie może być ponownie wielkości w niektórych okolicznościach\nFIX: Pozostawienie przestrzeni roboczej otwartej, czasami skutkuje dodaniem tych samych danych raz za razem\nFIX: Jeśli używany WebView na urządzeniach jest zbyt stary, nie można wyświetlić widoku życia (# 292, # 324)\nFIX: Nadpisywanie z funkcjami javascript może być nieprawdziwe jako datapoint {my.0.datapoint}\nFIX: Galeria nie pokazywała bezpośrednio ostatniego przesłanego zdjęcia, jeśli przesłała kilka zdjęć naraz\nDodano: Aktualizacja zależności (Adapter internetowy: 6.1.10 i Admin: 6.0.0 są teraz wymagane) (# 332)\nDodano: W obrębie obrazków można wybrać pliki dialogowe\nDodano: Obrazy mogą być teraz obracane\nDodano: Jeśli wartość ma być animowana podczas zmiany wartości, efekt wizualny jest dodawany w celu wskazania zmiany\nDodano: funkcje Undo und Redo są teraz dostępne globalnie\nDodano: Jeśli zaznaczone są elementy tego samego typu, użytkownik jest w stanie przeprowadzić na nich modyfikacje w jednym kroku (działania stos)\nDodano: Strg / Meta (Mac) + A wybiera teraz wszystkie elementy oprócz linii\nDodano: Kopiowane elementy mogą być teraz wstawione w bieżącej pozycji wskaźnika\nDodano: Przytrzymanie klawisza Shift umożliwia 2 tryby: 1. ruchome elementy z klawiatury, 10 kroków na klawisz prasa są możliwe jest 124; 2. ruchome elementy z myszką, element łapie w następnej siatce\nDodano: Ochrona haseł dla przestrzeni roboczej. Hasło można ustawić wewnątrz ustawień adaptera!\nDodano: Parametr URL \"lang = en\" może być teraz dołączony do URL, aby wyświetlić obszar roboczy widoku na żywo i konfiguracji w określonym języku\nDodano: Optymalizacja interfejsu użytkownika",
        "uk": "FIX: Якщо від'єднання рядка, початкова вибрана лінія була невибражена\nFIX: Робочий простір не може бути негабаритним за певних обставин\nFIX: Відкриваємо робочий простір, іноді призводить до додавання того ж джерела даних знову і знову\nFIX: Якщо використовується WebView на пристроях занадто старий, живий перегляд не може відображатися (#292, #324)\nFIX: Перезаписи з функціями javascript можна виявити як точка даних {my.0.datapoint}\nFIX: Галерея не показує останнього завантаженого зображення безпосередньо, якщо завантаження декількох зображень одночасно\nДодано: Залежності оновлено (Web-адаптер: 6.1.10 і Admin: 6.0.0 тепер потрібно) (#332)\nДоданий: Усередині зображення виберіть діалогове завантаження можливо\nДоданий: Фотографії тепер можна обертати\nДодано: Якщо значення встановлена для анімації при зміні значення, додається візуальний ефект для позначення зміни\nДодано: Undo und Redo функції тепер глобально availabe\nДодано: Якщо вибрані елементи одного типу, користувач зможе виконати модифікацію на них в одному кроці (стачні дії)\nДодано: Strg/Meta (Mac) + A тепер вибирає всі елементи, крім ліній\nДодано: Скопійовані елементи тепер можна вставляти в позицію поточного тостера\nДодано: Холдинг Shift ключ дозволяє 2 режими: 1. рухомі елементи з клавіатурою, 10 кроків на ключові преси можливі 2. рухомі елементи з мишею, елемент знімає в наступну сітку\nДодано: Захист паролів для робочого простору. Пароль може бути встановлений всередині адаптера-налаштування!\nДодано: параметр URL \"lang=en\" тепер може бути прикріплений до URL, для відображення простору роботи з живим переглядом та налаштуванням у визначеній мові\nДодано: Оптимізація UI",
        "zh-cn": "FIX: 如果线路重新连接中断, 初始选中的线路未被选中\nFIX: 在某些情况下无法调整工作空间的大小\nFIX: 离开工作空间打开, 有时会导致重复添加相同的数据源\nFIX: 如果设备上使用的WebView太老了, 无法显示现场视图( # 292, # 324)\nFIX:带有javascript函数的覆盖可以被检测为数据点{my.0.datapoint}\nFIX: 图片库没有直接显示上次上传的图像, 如果一次上传几个图像\n加: 属地更新(Web-Adapter: 6.1.10,管理者:现在需要6.0.0) (# 332)\n添加: 在图像内选择对话框上传是可能的\n添加: 现在可以旋转图片\n添加:如果一个值在改变值时被设定为动画,则添加视觉效果以表示变化\n添加: Uddo und Redo 函数现在已在全球范围内使用\n添加: 如果选择同一类型的元素, 用户可以在一步中执行修改( stack action)\n添加: Strag/Meta (Mac) + A 现在选择除行外的所有元素\n添加: 复制元素现在可以插入到当前指针位置\n添加: 抓住 Shift 密钥可允许 2 种模式 : 1. 带键盘的移动元素,每个键盘的10个步骤是可能的 \\ 2. 带鼠标的移动元素,元素在下一个网格中突起\n添加:工作空间密码保护. 密码可以在适配器设置内设置!\n添加: 现在可以将 URL 参数“ lang=en” 附加到 URL 上, 以定义的语言显示活视图和配置工作空间\n添加: UI 优化"
      },
      "0.6.2": {
        "en": "FIX: Further fix for properties of elements, if their value is empty or zero - elements could not be handled anymore\nFIX: While using installed browser application (PWA with https) or shortcuts on mobile devices, always instance 0 was fetched. Now each instance can be linked\nAdded: Improved language detection",
        "de": "FIX: Weiterer Fix für Elementeigenschaften: Wenn der Wert leer oder null ist, konnten Elemente nicht mehr verarbeitet werden.\nFIX: Bei Verwendung installierter Browseranwendungen (PWA mit https) oder Verknüpfungen auf Mobilgeräten wurde immer die Instanz 0 abgerufen. Jetzt kann jede Instanz verknüpft werden.\nHinzugefügt: Verbesserte Spracherkennung",
        "ru": "ИСПРАВЛЕНИЕ: Дальнейшее исправление свойств элементов, если их значение пустое или нулевое — элементы больше не могли обрабатываться\nИСПРАВЛЕНИЕ: При использовании установленного браузерного приложения (PWA с https) или ярлыков на мобильных устройствах всегда извлекался экземпляр 0. Теперь каждый экземпляр можно связать\nДобавлено: Улучшенное определение языка",
        "pt": "CORREÇÃO: Mais uma correção para propriedades de elementos, se o valor deles estiver vazio ou zero - os elementos não poderiam mais ser manipulados\nCORREÇÃO: Ao usar o aplicativo do navegador instalado (PWA com https) ou atalhos em dispositivos móveis, sempre a instância 0 era buscada. Agora, cada instância pode ser vinculada\nAdicionado: Detecção de idioma aprimorada",
        "nl": "FIX: Verdere fix voor eigenschappen van elementen, als hun waarde leeg of nul is - elementen konden niet meer worden verwerkt\nFIX: Bij gebruik van geïnstalleerde browserapplicatie (PWA met https) of snelkoppelingen op mobiele apparaten, werd altijd instance 0 opgehaald. Nu kan elke instance worden gekoppeld\nToegevoegd: Verbeterde taaldetectie",
        "fr": "CORRECTION : Correction supplémentaire pour les propriétés des éléments : si leur valeur est vide ou nulle, les éléments ne peuvent plus être gérés.\nCORRECTION : Lors de l'utilisation d'une application de navigateur installée (PWA avec https) ou de raccourcis sur appareils mobiles, l'instance 0 était toujours récupérée. Chaque instance peut désormais être liée.\nAjout : Amélioration de la détection de la langue.",
        "it": "FIX: Ulteriore correzione per le proprietà degli elementi, se il loro valore è vuoto o zero - gli elementi non potevano più essere gestiti\nFIX: Durante l'utilizzo dell'applicazione browser installata (PWA con https) o delle scorciatoie sui dispositivi mobili, veniva sempre recuperata l'istanza 0. Ora ogni istanza può essere collegata\nAggiunto: Rilevamento della lingua migliorato",
        "es": "CORRECCIÓN: Se corrigieron las propiedades de los elementos: si su valor estaba vacío o era cero, los elementos ya no se podían gestionar.\nCORRECCIÓN: Al usar la aplicación del navegador instalada (PWA con HTTPS) o accesos directos en dispositivos móviles, siempre se obtenía la instancia 0. Ahora se puede vincular cada instancia.\nAñadido: Detección de idioma mejorada.",
        "pl": "NAPRAWIONO: Dalsza poprawka dla właściwości elementów, jeśli ich wartość jest pusta lub zerowa - elementy nie mogą być już obsługiwane\nNAPRAWIONO: Podczas korzystania z zainstalowanej aplikacji przeglądarki (PWA z https) lub skrótów na urządzeniach mobilnych, zawsze pobierano wystąpienie 0. Teraz każde wystąpienie można połączyć\nDodano: Ulepszone wykrywanie języka",
        "uk": "ВИПРАВЛЕННЯ: Подальше виправлення властивостей елементів, якщо їхнє значення порожнє або нульове, елементи більше не можна обробляти\nВИПРАВЛЕННЯ: під час використання встановленої програми браузера (PWA з https) або ярликів на мобільних пристроях завжди завантажувався екземпляр 0. Тепер кожен екземпляр можна зв’язати\nДодано: покращене визначення мови",
        "zh-cn": "修复：进一步修复元素的属性，如果它们的值为空或零 - 元素将无法再处理\n修复：在移动设备上使用已安装的浏览器应用程序（带 https 的 PWA）或快捷方式时，始终会获取实例 0。现在可以链接每个实例\n添加：改进了语言检测"
      },
      "0.6.1": {
        "en": "Added: Linebreaks for states with numbers are also accepted\nAdded: Warning message during configuration, if element overrides can not be processed\nAdded: Some more Eslint checks for saver code\nAdded: Overrides for elements support now more complex code - even inside a function block and with variables\n:white_check_mark: FIX: New installed instance could crash, if the datsource is fetched for the first time \n:white_check_mark: FIX: Handler for malformatted overrides added, to prevent a crash of the adapter\n:white_check_mark: FIX: If width or height of elements are empty or smaller than zero, this setting could not be reverted",
        "de": "Hinzugefügt: Zeilenumbrüche für Zustände mit Zahlen werden ebenfalls akzeptiert.\nHinzugefügt: Warnmeldung während der Konfiguration, falls Elementüberschreibungen nicht verarbeitet werden können.\nHinzugefügt: Weitere Eslint-Prüfungen für sicheren Code.\nHinzugefügt: Überschreibungen für Elemente unterstützen nun komplexeren Code – auch innerhalb eines Funktionsblocks und mit Variablen.\n:white_check_mark: FIX: Neu installierte Instanz konnte abstürzen, wenn die Datenquelle zum ersten Mal abgerufen wurde.\n:white_check_mark: FIX: Handler für falsch formatierte Überschreibungen hinzugefügt, um einen Absturz des Adapters zu verhindern.\n:white_check_mark: FIX: Wenn Breite oder Höhe von Elementen leer oder kleiner als Null sind, konnte diese Einstellung nicht zurückgesetzt werden.",
        "ru": "Добавлено: также принимаются переносы строк для состояний с числами\nДобавлено: предупреждающее сообщение во время конфигурации, если переопределения элементов не могут быть обработаны\nДобавлено: еще несколько проверок Eslint для кода сохранения\nДобавлено: переопределения для элементов теперь поддерживают более сложный код — даже внутри функционального блока и с переменными\n:white_check_mark: ИСПРАВЛЕНИЕ: новый установленный экземпляр может аварийно завершить работу, если источник данных извлекается в первый раз\n:white_check_mark: ИСПРАВЛЕНИЕ: добавлен обработчик для неправильно отформатированных переопределений, чтобы предотвратить аварийное завершение работы адаптера\n:white_check_mark: ИСПРАВЛЕНИЕ: если ширина или высота элементов пусты или меньше нуля, эту настройку нельзя отменить",
        "pt": "Adicionado: quebras de linha para estados com números também são aceitas\nAdicionado: mensagem de aviso durante a configuração, se substituições de elementos não puderem ser processadas\nAdicionado: mais algumas verificações Eslint para código de proteção\nAdicionado: substituições para elementos agora suportam código mais complexo - mesmo dentro de um bloco de função e com variáveis\n:white_check_mark: CORREÇÃO: nova instância instalada pode travar, se a fonte de dados for buscada pela primeira vez\n:white_check_mark: CORREÇÃO: manipulador para substituições malformatadas adicionado, para evitar uma falha do adaptador\n:white_check_mark: CORREÇÃO: se a largura ou altura dos elementos estiverem vazias ou forem menores que zero, esta configuração não poderá ser revertida",
        "nl": "Toegevoegd: Regeleinden voor staten met nummers worden ook geaccepteerd\nToegevoegd: Waarschuwingsbericht tijdens configuratie, als elementoverschrijvingen niet kunnen worden verwerkt\nToegevoegd: Enkele extra Eslint-controles voor saver-code\nToegevoegd: Overrides voor elementen ondersteunen nu complexere code - zelfs binnen een functieblok en met variabelen\n:white_check_mark: FIX: Nieuw geïnstalleerd exemplaar kan crashen als de gegevensbron voor de eerste keer wordt opgehaald\n:white_check_mark: FIX: Handler voor verkeerd geformatteerde overschrijvingen toegevoegd, om een crash van de adapter te voorkomen\n:white_check_mark: FIX: Als de breedte of hoogte van elementen leeg is of kleiner is dan nul, kan deze instelling niet worden teruggedraaid",
        "fr": "Ajout : Les sauts de ligne pour les états numériques sont également acceptés.\nAjout : Message d'avertissement lors de la configuration si les remplacements d'éléments ne peuvent pas être traités.\nAjout : Vérifications Eslint supplémentaires pour le code de sauvegarde.\nAjout : Les remplacements d'éléments prennent désormais en charge du code plus complexe, même au sein d'un bloc fonctionnel et avec des variables.\n:white_check_mark: CORRECTION : Une nouvelle instance installée pouvait planter si la source de données était récupérée pour la première fois.\n:white_check_mark: CORRECTION : Ajout d'un gestionnaire pour les remplacements mal formatés afin d'éviter un plantage de l'adaptateur.\n:white_check_mark: CORRECTION : Si la largeur ou la hauteur des éléments était vide ou inférieure à zéro, ce paramètre était irréversible.",
        "it": "Aggiunto: sono accettate anche le interruzioni di riga per gli stati con numeri\nAggiunto: messaggio di avviso durante la configurazione, se gli override degli elementi non possono essere elaborati\nAggiunto: altri controlli Eslint per il codice saver\nAggiunto: gli override per gli elementi ora supportano codice più complesso, anche all'interno di un blocco funzione e con variabili\n:white_check_mark: CORREZIONE: la nuova istanza installata potrebbe bloccarsi se il datsource viene recuperato per la prima volta\n:white_check_mark: CORREZIONE: aggiunto gestore per override non formattati, per evitare un crash dell'adattatore\n:white_check_mark: CORREZIONE: se la larghezza o l'altezza degli elementi sono vuote o inferiori a zero, questa impostazione non può essere annullata",
        "es": "Añadido: También se aceptan saltos de línea para estados con números.\nAñadido: Mensaje de advertencia durante la configuración si no se pueden procesar las anulaciones de elementos.\nAñadido: Más comprobaciones de Eslint para el código del protector.\nAñadido: Las anulaciones de elementos ahora admiten código más complejo, incluso dentro de un bloque de función y con variables.\n:white_check_mark: CORRECCIÓN: La nueva instancia instalada podría bloquearse si se obtiene la fuente de datos por primera vez.\n:white_check_mark: CORRECCIÓN: Se añadió un controlador para anulaciones con formato incorrecto para evitar un bloqueo del adaptador.\n:white_check_mark: CORRECCIÓN: Si el ancho o la altura de los elementos están vacíos o son menores que cero, esta configuración no se pudo revertir.",
        "pl": "Dodano: Podziały wierszy dla stanów z numerami są również akceptowane\nDodano: Komunikat ostrzegawczy podczas konfiguracji, jeśli nadpisania elementów nie mogą zostać przetworzone\nDodano: Kilka dodatkowych sprawdzeń Eslint dla kodu saver\nDodano: Nadpisania dla elementów obsługują teraz bardziej złożony kod - nawet w bloku funkcji i ze zmiennymi\n:white_check_mark: NAPRAWIONO: Nowa zainstalowana instancja może ulec awarii, jeśli źródło danych jest pobierane po raz pierwszy\n:white_check_mark: NAPRAWIONO: Dodano obsługę nieprawidłowo sformatowanych nadpisań, aby zapobiec awarii adaptera\n:white_check_mark: NAPRAWIONO: Jeśli szerokość lub wysokość elementów jest pusta lub mniejsza od zera, tego ustawienia nie można cofnąć",
        "uk": "Додано: також приймаються розриви рядків для станів із числами\nДодано: попереджувальне повідомлення під час конфігурації, якщо перевизначення елемента не можна обробити\nДодано: ще кілька перевірок Eslint для коду збереження\nДодано: заміни для елементів тепер підтримують більш складний код - навіть усередині функціонального блоку та зі змінними\n:white_check_mark: ВИПРАВЛЕННЯ: новий встановлений екземпляр може аварійно завершувати роботу, якщо джерело даних отримано вперше \n:white_check_mark: ВИПРАВЛЕННЯ: додано обробник неправильно відформатованих змін, щоб запобігти збою адаптера\n:white_check_mark: ВИПРАВЛЕННЯ: якщо ширина або висота елементів порожні або менші за нуль, це налаштування неможливо скасувати",
        "zh-cn": "已添加：带数字的状态换行符也可接受\n已添加：如果无法处理元素覆盖，则在配置期间显示警告消息\n已添加：为保护程序代码添加了更多 Eslint 检查\n已添加：元素覆盖现在支持更复杂的代码 - 即使在函数块内和带有变量的情况下也是如此\n:white_check_mark: 修复：如果首次获取数据源，新安装的实例可能会崩溃\n:white_check_mark: 修复：添加了格式错误的覆盖处理程序，以防止适配器崩溃\n:white_check_mark: 修复：如果元素的宽度或高度为空或小于零，则无法恢复此设置"
      },
      "0.6.0": {
        "en": "FIX: Requested override value was not updated inside configuration, if state still has the same value\nAdded: Dependency Eslint 9.x for ioBroker code-check and performance",
        "de": "FIX: Der angeforderte Override-Wert wurde in der Konfiguration nicht aktualisiert, wenn der Status weiterhin den gleichen Wert aufweist.\nHinzugefügt: Abhängigkeit Eslint 9.x für ioBroker-Codeprüfung und Performance",
        "ru": "ИСПРАВЛЕНИЕ: Запрошенное значение переопределения не обновлялось внутри конфигурации, если состояние все еще имеет то же значение\nДобавлено: зависимость Eslint 9.x для проверки кода и производительности ioBroker",
        "pt": "CORREÇÃO: O valor de substituição solicitado não foi atualizado dentro da configuração, se o estado ainda tiver o mesmo valor\nAdicionado: Dependência Eslint 9.x para verificação de código e desempenho do ioBroker",
        "nl": "FIX: De gevraagde override-waarde werd niet bijgewerkt in de configuratie, als de status nog steeds dezelfde waarde heeft\nToegevoegd: Afhankelijkheid Eslint 9.x voor ioBroker-codecontrole en prestaties",
        "fr": "CORRECTION : La valeur de remplacement demandée n'était pas mise à jour dans la configuration, si l'état avait toujours la même valeur.\nAjout : Dépendance Eslint 9.x pour la vérification du code et les performances d'ioBroker.",
        "it": "FIX: il valore di override richiesto non è stato aggiornato all'interno della configurazione, se lo stato ha ancora lo stesso valore\nAggiunto: dipendenza Eslint 9.x per controllo codice e prestazioni ioBroker",
        "es": "CORRECCIÓN: El valor de anulación solicitado no se actualizaba en la configuración si el estado conservaba el mismo valor.\nAñadido: Dependencia de Eslint 9.x para la comprobación de código y el rendimiento de ioBroker.",
        "pl": "NAPRAWIONO: Żądana wartość nadpisania nie została zaktualizowana w konfiguracji, jeśli stan nadal ma tę samą wartość\nDodano: Zależność Eslint 9.x dla kontroli kodu i wydajności ioBroker",
        "uk": "ВИПРАВЛЕННЯ: Запитане значення заміни не було оновлено в конфігурації, якщо стан усе ще має те саме значення\nДодано: залежність Eslint 9.x для перевірки коду й продуктивності ioBroker",
        "zh-cn": "修复：如果状态仍具有相同的值，则请求的覆盖值未在配置中更新\n添加：用于 ioBroker 代码检查和性能的依赖项 Eslint 9.x"
      }
    },
    "titleLang": {
      "en": "Energiefluss - erweitert",
      "de": "Energiefluss - erweitert",
      "ru": "Поток энергии - erweitert",
      "pt": "Fluxo de energia - erweitert",
      "nl": "Energiestroom - uitgesteld",
      "fr": "Flux énergétique - étendu",
      "it": "Flusso di energia - esteso",
      "es": "Flujo de energía - ampliado",
      "pl": "Przepływ energii - rozwinięty",
      "uk": "Energiefluss - erweitert",
      "zh-cn": "能量流 - 延伸"
    },
    "desc": {
      "en": "It provides an animated energyflow for all elements, you add. This could be: photovoltaics, battery, house-consumption, grid-feed-in (grid-consumption), car charge etc.",
      "de": "Es bietet einen animierten Energiefluss für alle Elemente, die Sie hinzufügen. Dies können sein: Photovoltaik, Batterie, Eigenverbrauch, Netzeinspeisung (Netzverbrauch), Autoladung usw.",
      "ru": "Вы добавляете, что он обеспечивает анимированный поток энергии для всех элементов. Это может быть: фотоэлектричество, аккумулятор, потребление дома, подача в сеть (потребление в сеть), зарядка автомобиля и т. д.",
      "pt": "Ele fornece um fluxo de energia animado para todos os elementos, você adiciona. Isso pode ser: fotovoltaicos, bateria, consumo doméstico, alimentação da rede (consumo da rede), carga do carro etc.",
      "nl": "Het biedt een geanimeerde energiestroom voor alle elementen, voegt u toe. Dit kan zijn: fotovoltaïsche cellen, batterij, huisverbruik, netvoeding (netverbruik), autolading etc.",
      "fr": "Il fournit un flux d'énergie animé pour tous les éléments que vous ajoutez. Il peut s'agir de : photovoltaïque, batterie, autoconsommation, alimentation réseau (consommation réseau), recharge de voiture, etc.",
      "it": "Fornisce un flusso energetico animato per tutti gli elementi che aggiungi. Potrebbe essere: fotovoltaico, batteria, consumo domestico, immissione in rete (consumo in rete), carica auto ecc.",
      "es": "Proporciona un flujo de energía animado para todos los elementos, como: fotovoltaica, baterías, autoconsumo, inyección a la red (consumo de red), carga del coche, etc.",
      "pl": "Zapewnia animowany przepływ energii dla wszystkich elementów, które dodajesz. Może to być: fotowoltaika, bateria, zużycie energii w domu, zasilanie sieciowe (zużycie sieciowe), ładowanie samochodu itp.",
      "uk": "Він забезпечує анімований потік енергії для всіх елементів, які ви додаєте. Це може бути: фотовольтаїка, батарея, домашнє споживання, живлення від мережі (споживання від мережі), зарядка автомобіля тощо.",
      "zh-cn": "它为您添加的所有元素提供动画能量流。这些元素可能是：光伏、电池、房屋消耗、电网馈入（电网消耗）、汽车充电等。"
    },
    "authors": [
      "SKB <info@skb-web.de>"
    ],
    "keywords": [
      "energy",
      "energy-flow",
      "energie",
      "energiefluss",
      "energiefluss-erweitert",
      "photovoltaics",
      "Photovoltaik",
      "Solar",
      "flot",
      "flow",
      "VIS"
    ],
    "platform": "Javascript/Node.js",
    "icon": "energiefluss-erweitert.png",
    "enabled": true,
    "localLinks": {
      "_default": "%web_protocol%://%ip%:%web_port%/energiefluss-erweitert/index.html?instance=%instance%"
    },
    "extIcon": "https://raw.githubusercontent.com/SKB-CGN/ioBroker.energiefluss-erweitert/main/admin/energiefluss-erweitert.png",
    "readme": "https://github.com/SKB-CGN/ioBroker.energiefluss-erweitert/blob/main/README.md",
    "loglevel": "info",
    "webExtension": "lib/web.js",
    "mode": "daemon",
    "tier": 3,
    "type": "visualization",
    "compact": true,
    "connectionType": "local",
    "dataSource": "assumption",
    "welcomeScreen": {
      "link": "energiefluss-erweitert/",
      "name": "energiefluss-erweitert",
      "img": "energiefluss-erweitert/img/icons/android/android-launchericon-96-96.png",
      "color": "#538ea3",
      "order": 0
    },
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "adminUI": {
      "config": "materialize",
      "tab": false
    },
    "dependencies": [
      {
        "js-controller": ">=5.0.19",
        "web": ">=6.1.10"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.4.10"
      }
    ],
    "dataFolder": "energiefluss-erweitert.%INSTANCE%",
    "messagebox": true
  },
  "messages": [
    {
      "condition": {
        "operand": "and",
        "rules": [
          "oldVersion<0.3.1",
          "newVersion>=0.3.1"
        ]
      },
      "title": {
        "en": "Mandatory changes inside Calculation Tab"
      },
      "text": {
        "en": "For better handling of the battery charging calculation, the capacity and the DoD (Depth of Discharge) of the battery need to be provided via datasources now!"
      },
      "level": "warn",
      "buttons": [
        "agree",
        "cancel"
      ]
    }
  ],
  "protectedNative": [
    "password"
  ],
  "encryptedNative": [
    "password"
  ],
  "native": {
    "webInstance": "*",
    "password": ""
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "configuration",
      "type": "state",
      "common": {
        "name": "JSON Configuration of the elements",
        "type": "json",
        "role": "state",
        "read": true,
        "write": false,
        "def": "{}"
      },
      "native": {}
    },
    {
      "_id": "data",
      "type": "state",
      "common": {
        "name": "Data for HTML Output",
        "type": "json",
        "role": "state",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "calculation",
      "type": "channel",
      "common": {
        "name": "Calculations provided by the adapter"
      },
      "native": {}
    },
    {
      "_id": "calculation.battery",
      "type": "channel",
      "common": {
        "name": "Battery"
      },
      "native": {}
    },
    {
      "_id": "calculation.consumption",
      "type": "channel",
      "common": {
        "name": "Consumption"
      },
      "native": {}
    },
    {
      "_id": "calculation.production",
      "type": "channel",
      "common": {
        "name": "Production"
      },
      "native": {}
    },
    {
      "_id": "calculation.elements",
      "type": "channel",
      "common": {
        "name": "Additions and Subtractions of elements"
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.remaining",
      "type": "state",
      "common": {
        "name": "Remaining Time of the battery",
        "type": "string",
        "role": "state",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.remaining_target",
      "type": "state",
      "common": {
        "name": "Target of the remaining Time of the battery",
        "type": "number",
        "role": "value.time",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.remaining_target_DT",
      "type": "state",
      "common": {
        "name": "Target of the remaining Time of the battery (Date&Time)",
        "type": "string",
        "role": "value",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.charging_grid",
      "type": "state",
      "common": {
        "name": "Current Charging via Grid",
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "W"
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.charging_solar",
      "type": "state",
      "common": {
        "name": "Current Charging via Solar",
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "W"
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.remaining_energy",
      "type": "state",
      "common": {
        "name": "Current Power available in battery",
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "Wh"
      },
      "native": {}
    },
    {
      "_id": "calculation.consumption.consumption",
      "type": "state",
      "common": {
        "name": "Current Consumption",
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "W"
      },
      "native": {}
    },
    {
      "_id": "calculation.production.production",
      "type": "state",
      "common": {
        "name": "Current Production",
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "W"
      },
      "native": {}
    },
    {
      "_id": "",
      "type": "meta",
      "common": {
        "name": "Storage for energiefluss-erweitert",
        "type": "meta.user"
      },
      "native": {}
    }
  ]
}
