{
  "common": {
    "name": "energiefluss-erweitert",
    "version": "0.8.1",
    "news": {
      "0.8.1": {
        "en": "FIX: Dialog for line animation overrides was not opening\nAdded: VIS and VIS-2 widget added. Just drag the widget to VIS and set the adapter instance",
        "de": "FIX: Dialog für Linienanimationsüberschreitungen war nicht geöffnet\nHinzugefügt: VIS und VIS-2 Widget hinzugefügt. Ziehen Sie einfach das Widget auf VIS und setzen Sie die Adapterinstanz",
        "ru": "FIX: Диалог для линейной анимации не открывается\nДобавлен виджет VIS и VIS-2. Просто перетащите виджет в VIS и установите экземпляр адаптера",
        "pt": "FIX: A janela para sobreposições de animação de linha não estava abrindo\nAdicionado: VIS e VIS-2 widget adicionado. Basta arrastar o widget para o VIS e definir a instância do adaptador",
        "nl": "FIX: dialoogvenster voor regelanimatie-overrides werd niet geopend\nToegevoegd: VIS en VIS-2 widget toegevoegd. Sleep gewoon het widget naar VIS en stel de adapter in",
        "fr": "FIX: La boîte de dialogue pour l'animation en ligne ne s'ouvrait pas\nAjouté: VIS et Vis-2 widget ajouté. Il suffit de glisser le widget vers VIS et de définir l'instance de l'adaptateur",
        "it": "FIX: Il dialogo per i overrides di animazione della linea non è stato aperto\nAggiunto: VIS and VIS-2 widget aggiunto. Basta trascinare il widget su VIS e impostare l'istanza dell'adattatore",
        "es": "FIX: El diagrama de anulación de animación en línea no fue la apertura\nAñadido: VIS y VIS-2 widget añadido. Sólo arrastra el widget a VIS y establece la instancia del adaptador",
        "pl": "FIX: Okno animacji linii nie otwierało się\nDodano: dodano widżet VIS i VIS-2. Wystarczy przeciągnąć widżet do VIS i ustawić instancję adaptera",
        "uk": "FIX: Діалог для лінійної анімації\nДодано: VIS і VIS-2 віджет. Просто перетягніть віджет до VIS і встановіть екземпляр адаптера",
        "zh-cn": "FIX: 线条动画覆盖的对话框没有打开\n添加:VIS和VIS-2部件添加. 把部件拖到VIS并设置适配器实例"
      },
      "0.8.0": {
        "en": "FIX: Editing a datasource was not accepting the new choosen state (#374)\nFIX: When using **Animation dependency** 'Dots' or 'Duration' the animation could \"jump\" during recalculation (now the 'jump' is smoothly animated)\nFIX: 'Manual value change' of click actions now better detect the value type of the destination source\nFIX: Line was not hidden when 2 directions *and* display dependency are enabled\nAdded: A new property 'Distance between the dot blocks' inside 'animation'-tab is available. This setting can be used, to define the distance between dot-blocks\nAdded: Some more error handling for overrides. Now they are checked, if they have the correct format and/or syntax\nAdded: 2 new override properties are available: \"addClass\" and \"removeClass\" which allow the user, to add or remove own defined CSS classes\nAdded: The workspace will be centered itself to the current selected element\nAdded: Better support for touch-devices including different modes for moving the workspace and editing elements\nAdded: Few language and design corrections, code optimization\nAdded: Right Clicking or long press on liveview opens a context menu, to easily switch between instances or display the configuration",
        "de": "FIX: Die Bearbeitung einer Datenquelle hat den neuen ausgewählten Zustand nicht akzeptiert (#374)\nFIX: Bei Verwendung von **Animationsabhängigkeit* 'Dots' oder 'Duration' konnte die Animation während der Neuberechnung \"springen\" (jetzt ist der 'Jump' glatt animiert)\nFIX: 'Manual Value change' von Klickaktionen jetzt besser erkennen den Werttyp der Zielquelle\nFIX: Linie wurde nicht versteckt, wenn 2 Richtungen *und* Anzeige Abhängigkeit aktiviert sind \nHinzugefügt: Eine neue Eigenschaft 'Distance zwischen den Punkten Blöcke' in 'animation'-tab ist verfügbar. Diese Einstellung kann verwendet werden, um den Abstand zwischen Punktblöcken zu definieren\nHinzugefügt: Einige weitere Fehlerbehandlung für Overrides. Jetzt werden sie überprüft, wenn sie das richtige Format und/oder Syntax haben\nHinzugefügt: 2 neue Override-Eigenschaften sind verfügbar: \"addClass\" und \"removeClass\", die dem Benutzer erlauben, eigene definierte CSS-Klassen hinzuzufügen oder zu entfernen\nHinzugefügt: Der Arbeitsraum wird sich zum aktuellen ausgewählten Element zentrieren\nHinzugefügt: Bessere Unterstützung für Touch-Devices einschließlich verschiedener Modi zum Bewegen des Arbeitsraums und der Bearbeitungselemente\nHinzugefügt: Weniger Sprach- und Designkorrekturen, Codeoptimierung\nHinzugefügt: Rechtsklicken oder lange Presse auf Liveview öffnet ein Kontextmenü, um einfach zwischen Instanzen zu wechseln oder die Konfiguration anzuzeigen",
        "ru": "Редактирование источника данных не принимало новое выбранное состояние (#374)\nFIX: При использовании **ависимости от анимации** «Точки» или «Продолжительность» анимация может «прыгать» во время пересчета (теперь «прыжок» плавно анимируется) \nFIX: «Ручное изменение значения» кликов теперь лучше определяет тип значения источника назначения\nFIX: Линия не была скрыта при включении 2 направлений ** зависимости дисплея \nДобавлено: доступно новое свойство «Расстояние между точечными блоками» внутри «анимации»-таба. Этот параметр можно использовать для определения расстояния между точками-блоками\nДобавлено: Еще несколько ошибок для исправлений. Теперь они проверяются, если у них правильный формат и/или синтаксис\nДобавлено: 2 новых свойства override доступны: «addClass» и «removeClass», которые позволяют пользователю добавлять или удалять собственные определенные классы CSS\nРабочее пространство будет сосредоточено на текущем выбранном элементе\nДобавлено: улучшенная поддержка сенсорных устройств, включая различные режимы перемещения рабочего пространства и элементы редактирования\nДобавлено: Немногие исправления языка и дизайна, оптимизация кода\nДобавлено: Правильное нажатие или длительное нажатие на liveview открывает контекстное меню, чтобы легко переключаться между экземплярами или отображать конфигурацию",
        "pt": "FIX: Editar um datasource não estava aceitando o novo estado escolhido (# 374)\nFIX: Ao usar **Dependência de animação** 'Pontos' ou 'Duração' a animação poderia \"pular\" durante o recalculamento (agora o 'jump' é suavemente animado)\nFIX: 'Mudança de valor manual' das ações de clique agora melhor detectar o tipo de valor da fonte de destino\nFIX: A linha não foi ocultada quando duas direções *e* dependência de exibição estão habilitadas \nAdicionado: Uma nova propriedade 'Distância entre os blocos de pontos' dentro 'animação'-tab está disponível. Esta configuração pode ser usada, para definir a distância entre pontos-blocos\nAdicionado: Um pouco mais de manipulação de erros para sobreposições. Agora eles são verificados, se eles têm o formato correto e/ou sintaxe\nAdicionado: 2 novas propriedades de sobreposição estão disponíveis: \"addClass\" e \"removeClass\" que permitem ao usuário adicionar ou remover classes próprias definidas de CSS\nAdicionado: O espaço de trabalho será centrado no elemento selecionado atualmente\nAdicionado: Melhor suporte para dispositivos de toque, incluindo diferentes modos para mover o espaço de trabalho e editar elementos\nAdicionado: Poucas correções de linguagem e design, otimização de código\nAdicionado: Clicando direito ou pressione longo em liveview abre um menu de contexto, para facilmente alternar entre instâncias ou exibir a configuração",
        "nl": "FIX: Het bewerken van een databron was het niet accepteren van de nieuwe gekozen toestand (#374)\nFIX: Bij gebruik van **Animatieafhankelijkheid** 'Dots' of 'Duration' kan de animatie \"springen\" tijdens herberekening (nu is de 'sprong' soepel geanimeerd)\nFIX: 'Handmatige waardeverandering' van klikacties kan nu beter het waardetype van de bestemmingsbron detecteren\nFIX: lijn was niet verborgen wanneer 2 richtingen *en*-afhankelijkheid van het beeldscherm zijn ingeschakeld\nToegevoegd: Een nieuwe eigenschap 'Afstand tussen de puntblokken' binnen 'animatie'-tab is beschikbaar. Deze instelling kan gebruikt worden om de afstand tussen punt-blokken te definiëren\nToegevoegd: Wat meer foutafhandeling voor overschrijven. Nu worden ze gecontroleerd, als ze het juiste formaat en/of syntax hebben\nToegevoegd: 2 nieuwe override eigenschappen zijn beschikbaar: \"addClass\" en \"removeClass\" waarmee de gebruiker, toe te voegen of te verwijderen eigen gedefinieerde CSS klassen\nToegevoegd: De werkruimte wordt gecentreerd naar het huidige geselecteerde element\nToegevoegd: Betere ondersteuning voor touch-devices inclusief verschillende modi voor het verplaatsen van de werkruimte en het bewerken van elementen\nToegevoegd: Weinig taal en ontwerp correcties, code optimalisatie\nToegevoegd: Rechts klikken of lang drukken op liveview opent een contextmenu, om eenvoudig te schakelen tussen instanties of de configuratie weer te geven",
        "fr": "FIX: Modifier une source de données n'acceptait pas le nouvel état choisi (#374)\nFIX: En utilisant **Dépendance de l'animation** 'Dots' ou 'Duration' l'animation pourrait \"jump\" pendant le recalcul (maintenant le 'jump' est animé en douceur)\nFIX: 'Modification manuelle de la valeur' des actions de clics permet de mieux détecter le type de valeur de la source de destination\nFIX : La ligne n'était pas cachée lorsque 2 directions *et* sont activées\nAjouté: Une nouvelle propriété 'Distance entre les blocs de points' à l'intérieur 'animation'-tab est disponible. Ce réglage peut être utilisé pour définir la distance entre les blocs de points\nAjouté : Plus de gestion d'erreur pour les surcharges. Maintenant, ils sont vérifiés, s'ils ont le bon format et/ou syntaxe\nAjouté : 2 nouvelles propriétés de redéfinition sont disponibles : \"addClass\" et \"removeClass\" qui permettent à l'utilisateur, d'ajouter ou de supprimer ses propres classes CSS définies\nAjouté : L'espace de travail sera centré sur l'élément sélectionné\nAjout : meilleure prise en charge des appareils tactiles incluant différents modes de déplacement de l'espace de travail et des éléments d'édition\nAjouté: Peu de corrections de langage et de conception, optimisation du code\nAjouté : Le clic droit ou la longue pression sur liveview ouvre un menu contextuel, pour basculer facilement entre les instances ou afficher la configuration",
        "it": "FIX: Modificare una fonte di dati non era accettare il nuovo stato scelto (#374)\nFIX: Quando si utilizza **Animation dependency** 'Dots' o 'Duration' l'animazione potrebbe \"giumpare\" durante il ricalcolo (ora il 'jump' è lisciamente animato)\nFIX: 'Modifica del valore manuale' delle azioni di clic ora meglio rilevare il tipo di valore della sorgente di destinazione\nFIX: La linea non è stata nascosta quando sono abilitate 2 direzioni *e*\nAggiunto: A new property 'Distance tra i blocchi di punti' dentro 'animation'-tab è disponibile. Questa impostazione può essere utilizzata, per definire la distanza tra dot-blocks\nAggiunto: Alcuni più trattamento di errore per overrides. Ora sono controllati, se hanno il formato corretto e/o sintassi\nAggiunto: 2 nuove proprietà override sono disponibili: \"addClass\" e \"removeClass\" che permettono all'utente, di aggiungere o rimuovere le proprie classi CSS definite\nAggiunto: The workspace will be centered a the current select element\nAggiunto: Better support for touch-devices tra cui diverse modalità per spostare lo spazio di lavoro e gli elementi di editing\nAggiunto: Poche correzioni linguistiche e di design, ottimizzazione del codice\nAggiunto: Right Clicking or long press on liveview apre un menu di contesto, per passare facilmente tra le istanze o visualizzare la configurazione",
        "es": "FIX: Editar un datasource no estaba aceptando el nuevo estado elegido (#374)\nFIX: Al usar ** dependencia de la animación** 'Dots' o 'Duración' la animación podría \"saltar\" durante la recalculación (ahora el 'jump' es suavemente animado)\nFIX: 'Cambio de valor manual' de las acciones de clic ahora mejor detectar el tipo de valor de la fuente de destino\nFIX: La línea no estaba oculta cuando 2 direcciones *y* función de visualización están habilitadas\nAñadido: Una nueva propiedad 'Distance between the dot blocks' dentro de 'animación'-tab está disponible. Este ajuste se puede utilizar para definir la distancia entre los bloques de puntos\nAñadido: Algo más manejo de errores para anulaciones. Ahora se verifican, si tienen el formato correcto y/o sintaxis\nAñadido: 2 nuevas propiedades de anulación están disponibles: \"addClass\" y \"removeClass\" que permiten al usuario añadir o eliminar clases de CSS definidas\nAñadido: El espacio de trabajo se centrará en el elemento seleccionado actual\nAñadido: Mejor soporte para dispositivos táctiles incluyendo diferentes modos para mover el espacio de trabajo y elementos de edición\nAñadido: pocas correcciones de lenguaje y diseño, optimización de código\nAñadido: Hacer clic derecho o presionar largamente en directo abre un menú contextual, para cambiar fácilmente entre instancias o mostrar la configuración",
        "pl": "FIX: Edycja danych nie przyjęła nowego stanu wyboru (# 374)\nFIX: Przy użyciu ** zależności animacji* * 'Dots' lub 'Czas trwania' animacja może \"skakać\" podczas ponownego obliczenia (teraz 'jump' jest płynnie animowany) \nFIX: 'Ręczna zmiana wartości' akcji kliknij teraz lepiej wykryć typ wartości źródła docelowego\nFIX: Linia nie była ukryta, gdy włączone są 2 kierunki *i* \nDodano: Dostępna jest nowa właściwość 'Odległość między blokami kropkowymi' wewnątrz 'animacji' -tab. To ustawienie może być użyte, do określenia odległości między blokami dot-\nDodano: Więcej obsługi błędów w przypadku przekroczenia. Teraz są sprawdzane, jeśli mają poprawny format i / lub składnia\nDodano: dostępne są 2 nowe właściwości: \"addClass\" i \"removeClass\", które umożliwiają użytkownikowi dodanie lub usunięcie własnych określonych klas CSS\nDodano: przestrzeń robocza zostanie wyśrodkowana do bieżącego wybranego elementu\nDodano: Lepsze wsparcie dla urządzeń dotykowych, w tym różnych trybów poruszania przestrzeni roboczej i elementów edycyjnych\nDodano: Kilka poprawek językowych i projektowych, optymalizacja kodu\nDodano: Prawe kliknięcie lub długie naciśnięcie na liveview otwiera menu kontekstowe, aby łatwo przełączać się między instancjami lub wyświetlać konfigurację",
        "uk": "FIX: Редагування джерела даних не приймав новий стан вибірки (#374)\nFIX: При використанні **Анімація залежності*** 'Діти' або 'Duration' анімація може \"стрибати\" при перерахунку (нині 'jump' гладко анімований)\nFIX: 'Управління зміною значення' клацання дій зараз краще виявити тип значення джерела призначення\nFIX: Лінія не була прихована, коли ввімкнено 2 напрямки\nДодано: Нова властивість 'Дистанс між блоками точок' всередині 'animation'-tab доступна. Ця установка може бути використана, щоб визначити відстань між dot-blocks\nДодано: Деякі більше помилок обробки для перенаряддя. Тепер вони перевіряють, якщо вони мають правильний формат та / або синтаксис\nДодано: 2 нові наднарядні властивості доступні: \"addClass\" і \"removeClass\", які дозволяють користувачеві додавати або видалити власні визначені класи CSS\nДодано: Робочий простір буде зосереджений самому до поточного вибраного елементу\nДодано: Кращий супровід сенсорних пристроїв, включаючи різні режими переміщення робочих місць та елементів редагування\nДодано: Few мови та корекції дизайну, оптимізація коду\nДодано: Клацніть правою кнопкою миші або довго натисніть на перегляд, відкриває контекстне меню, щоб легко переключати між екземплярами або відображати конфігурацію",
        "zh-cn": "FIX: 编辑数据源不会接受新选择状态(# 374)\nFIX:当使用 ** 动画依赖** 'Dots' 或 'Duration' 动画在重新计算时可以\"跳动\"(现在的\"跳动\"是平稳的动画)\nFIX: 点击动作的“ 手动值变化 ” 现在更好地检测目标源的值类型\nFIX: 当启用2个方向 *和* 显示依赖性时, 行未隐藏 \n添加: “ 激活” - tab 内有一个新的属性“ 点块之间的分隔 ” 。 此设置可用于定义点块之间的距离\n添加: 更多超常错误处理 。 现在检查它们,如果它们有正确的格式和/或语法\n添加: 2 新的覆盖属性可供使用 : \"addClass\" 和 \"removeClass\" 允许用户添加或删除自定义的 CSS 类\n添加: 工作空间会以当前选定元素为中心\n添加:更好地支持触摸设备,包括移动工作空间和编辑元素的不同模式\n添加:很少语言和设计校正,代码优化\n添加: 在liview上右键点击或按长键打开上下文菜单, 方便在实例间切换或显示配置"
      },
      "0.7.8": {
        "en": "Added: Convert a text element to a datasource element\nAdded: Now supports Web-Adapter with socket.io adapter used (#333)",
        "de": "Hinzugefügt: Konvertieren Sie ein Textelement zu einem Datenquellenelement\nHinzugefügt: Jetzt unterstützt Web-Adapter mit Buchse.io Adapter verwendet (#333)",
        "ru": "Добавлено: Преобразование текстового элемента в элемент источника данных\nТеперь поддерживает Web-Adapter с помощью адаптера socket.io (#333)",
        "pt": "Adicionado: Converta um elemento de texto para um elemento de fonte de dados\nAdicionado: Agora suporta Web-Adapter com socket.io adaptador usado (#333)",
        "nl": "Toegevoegd: Een tekstelement omzetten naar een databronelement\nToegevoegd: Nu ondersteunt Web-Adapter met socket.io adapter gebruikt (#333)",
        "fr": "Ajouté : Convertir un élément texte en un élément datasource\nAjouté : prend désormais en charge Web-Adapter avec socket.io adaptateur utilisé (#333)",
        "it": "Aggiunto: Convertire un elemento di testo in un elemento datasource\nAggiunto: Now Supporta Web-Adapter con socket.io adattatore utilizzato (#333)",
        "es": "Añadido: Convertir un elemento de texto en un elemento fuente de datos\nAñadido: Ahora soporta Web-Adapter con adaptador socket.io utilizado (#333)",
        "pl": "Dodano: Konwersja elementu tekstowego do elementu danych\nDodano: Teraz obsługuje Web- Adapter z socket.io adapter używany (# 333)",
        "uk": "Додано: Перетворення текстового елемента до елемента джерела даних\nДодано: Тепер підтримує Web-адаптер з адаптером Socket.io (#333)",
        "zh-cn": "添加: 将文本元素转换为数据源元素\n添加: 现在支持使用套接字的 Web-Adapter (# 333)"
      },
      "0.7.7": {
        "en": "FIX: Issues found by ioBroker-Adapter-Checker (348)\nAdded: When adding a new datasource, the associated name of this datasource is set as recommended alias",
        "de": "FIX: Probleme gefunden von ioBroker-Adapter-Checker (348)\nHinzugefügt: Beim Hinzufügen einer neuen Datenquelle wird der zugehörige Name dieser Datenquelle als empfohlene Alias gesetzt",
        "ru": "Вопросы, найденные ioBroker-Adapter-Checker (348)\nДобавлено: При добавлении нового источника данных соответствующее имя этого источника данных устанавливается в качестве рекомендуемого псевдонима",
        "pt": "FIX: Problemas encontrados pelo ioBroker-Adapter-Checker (348)\nAdicionado: Ao adicionar um novo código de dados, o nome associado deste código de dados é definido como alias recomendados",
        "nl": "FIX: Problemen gevonden door ioBroker-Adapter-Checker (348)\nToegevoegd: Bij het toevoegen van een nieuwe gegevensbron wordt de geassocieerde naam van deze gegevensbron ingesteld als aanbevolen alias",
        "fr": "FIX: Problèmes trouvés par ioBroker-Adapter-Checker (348)\nAjouté : Lors de l'ajout d'une nouvelle source de données, le nom associé de cette source de données est défini comme alias recommandé",
        "it": "FIX: Problemi trovati da ioBroker-Adapter-Checker (348)\nAggiunto: Quando si aggiunge una nuova datasource, il nome associato di questa datasource viene impostato come alias consigliato",
        "es": "FIX: Problemas encontrados por ioBroker-Adapter-Checker (348)\nAñadido: Al agregar un nuevo fuente de datos, el nombre asociado de este fuente de datos se establece como alias recomendados",
        "pl": "FIX: Issues found by jOBroker- Adapter- Checker (348)\nDodano: Przy dodawaniu nowych danych, powiązana nazwa tych danych jest ustawiana jako rekomendowany alias",
        "uk": "FIX: Питання, знайдені ioBroker-адаптер-Checker (348)\nДодано: При додаванні нового джерела даних, асоційоване ім'я цього джерела даних встановлюється як рекомендована псевдонім",
        "zh-cn": "FIX: ioBroker-Adapter-Checker(348)发现的问题\n添加:在添加新数据源时,此数据源的相关名称被设定为推荐的别名"
      },
      "0.7.6": {
        "en": "FIX: Removed instances from welcome screen, as this is confusing, if not using iobroker.pro",
        "de": "FIX: Entfernen von Instanzen vom Willkommensbildschirm, da dies verwirrend ist, wenn nicht mit iobroker. Produzent",
        "ru": "FIX: удаленные экземпляры с приветственного экрана, так как это сбивает с толку, если не использовать iobroker. про",
        "pt": "FIX: instâncias removidas da tela de boas-vindas, como isso é confuso, se não estiver usando o iobroker. pro",
        "nl": "FIX: Verwijderde gevallen van welkom scherm, omdat dit verwarrend is, als niet met behulp van iobroker. pro",
        "fr": "FIX: Supprimé les instances de l'écran d'accueil, car cela est déroutant, si pas utiliser iobroker. pour",
        "it": "FIX: Le istanze eliminate dalla schermata di benvenuto, in quanto questo è confuso, se non utilizzando lo iobroker. Pro",
        "es": "FIX: Quitar las instancias de la pantalla de bienvenida, ya que esto es confuso, si no utilizar iobroker. pro",
        "pl": "FIX: Usunięto instancje z ekranu powitalnego, ponieważ jest to mylące, jeśli nie używa iobrokera. pro",
        "uk": "FIX: Вилучені екземпляри з екрана привітання, оскільки це конфускування, якщо не використовувати іоброкер. Про нас",
        "zh-cn": "FIX: 从欢迎屏幕中删除了实例, 因为这样会让人困惑, 亲"
      },
      "0.7.5": {
        "en": "FIX: Override for bordercolor and borderfillcolor were not correctly applied on rect or circle\nFIX: If user-defined iframe was too small, animation was not applied\nFIX: Timer corrected for using \"Line animation during startup\" or \"Show line between elements only\"\nAdded: Reworked function, to better detect overrides for > (greater than) or < (smaller than) with negative values\nAdded: \"default\" option for override can now contain javascript function code and additional states to be fetched\nAdded: \"Fill outline\" and \"Fill element\" according to value now support value overrides\nAdded: Version check removed, as this is confusing, if user uses the default repository and Github has a new BETA version\nAdded: New line-end for filling outline according to value added. Can now be round, square and butt\nAdded: Few language corrections",
        "de": "FIX: Override für Randfarbe und Randfillcolor wurden nicht korrekt auf Rekt oder Kreis angewendet\nFIX: Wenn benutzerdefinierte iframe zu klein war, wurde Animation nicht angewendet\nFIX: Timer korrigiert für die Verwendung \"Line-Animation während des Starts\" oder \"Zeilen zwischen Elementen nur anzeigen\"\nHinzugefügt: Reworked-Funktion, um Überschreitungen für > (größer als) oder < (kleiner als) mit negativen Werten besser zu erkennen\nHinzugefügt: \"default\" Option für Override kann jetzt Javascript-Funktionscode enthalten und zusätzliche Zustände zu holen\nHinzugefügt: \"Fill Umriss\" und \"Fill element\" nach Wert jetzt Stützwert überrides\nHinzugefügt: Versionskontrolle entfernt, da dies verwirrend ist, wenn der Benutzer das Standard-Repository verwendet und Github eine neue BETA-Version hat\nHinzugefügt: Neues Line-End zum Befüllen von Umrissen nach Wertschöpfung. Kann jetzt rund sein, Quadrat und Hintern\nHinzugefügt: Nur wenige Sprachkorrekturen",
        "ru": "FIX: Оверрайд для пограничного цвета и пограничного цвета неправильно наносится на прямую или окружность\nFIX: Если пользовательский iframe был слишком мал, анимация не применялась\nFIX: таймер с поправкой на использование «линейной анимации во время запуска» или «показать только линию между элементами»\nДобавлено: Переработанная функция, чтобы лучше обнаруживать переопределения для > (больше, чем) или < (меньше, чем) с отрицательными значениями\nДобавлено: опция «по умолчанию» для override теперь может содержать код функции JavaScript и дополнительные состояния для извлечения\nДобавлено: \"Fill outline\" и \"Fill element\" по значению теперь поддерживают переопределение значений\nДобавлено: проверка версий удалена, так как это сбивает с толку, если пользователь использует репозиторий по умолчанию и у Github есть новая версия BETA\nДобавлено: новый линейный конец для заполнения схемы в соответствии с добавленной стоимостью. Теперь может быть круглой, квадратной и задней\nДобавлено: Несколько языковых исправлений",
        "pt": "CORREÇÃO: A substituição para a cor de fronteira e a cor de preenchimento de borda não foram corretamente aplicadas em rect ou círculo\nFIX: Se o iframe definido pelo usuário era muito pequeno, a animação não foi aplicada\nFIX: Timer corrigido para usar \"Linha de animação durante a inicialização\" ou \"Mostrar linha entre elementos apenas\"\nAdicionado: Reworked function, para melhor detectar overrides para > (maior do que) ou < (mais pequeno do que) com valores negativos\nAdicionado: \"default\" opção para override agora pode conter código de função javascript e estados adicionais para ser fetched\nAdicionado: \"Fill outline\" e \"Fill element\" de acordo com o valor agora suporta overrides valor\nAdicionado: Versão check removido, como isso é confuso, se o usuário usa o repositório padrão e Github tem uma nova versão BETA\nAdicionado: Novo line-end para preenchimento delineado de acordo com o valor adicionado. Agora pode ser redondo, quadrado e bunda\nAdicionado: Poucas correções de idioma",
        "nl": "FIX: Overschrijven voor randkleur en randvullingkleur werden niet correct toegepast op rechte of cirkel\nFIX: Als door de gebruiker gedefinieerde iframe te klein was, werd geen animatie toegepast\nFIX: Timer gecorrigeerd voor het gebruik van \"Line animatie tijdens het opstarten\" of \"Alleen lijn tussen elementen tonen\"\nToegevoegd: Herwerkte functie, om de override beter te detecteren voor > (groter dan) of < (kleiner dan) met negatieve waarden\nToegevoegd: \"default\" optie voor override kan nu javascript functie code en extra toestanden te halen bevatten\nToegevoegd: \"Fill outline\" en \"Fill element\" volgens waarde nu ondersteunen waarde overrides\nToegevoegd: Versiecontrole verwijderd, omdat dit verwarrend is, als de gebruiker de standaard repository gebruikt en Github een nieuwe BETA versie heeft\nToegevoegd: Nieuw regeleinde voor het vullen van schema volgens toegevoegde waarde. Kan nu rond, vierkant en kont\nToegevoegd: Weinig taalcorrecties",
        "fr": "FIX: La couleur de bordure et la couleur de bordure de remplissage n'ont pas été correctement appliquées sur rect ou cercle\nFIX: Si iframe défini par l'utilisateur était trop petit, l'animation n'a pas été appliquée\nFIX: Chronomètre corrigé pour utiliser \"Line animation pendant le démarrage\" ou \"Show line between elements only\"\nAjout : Fonction retravaillée, pour mieux détecter les dépassements pour > (plus grande que) ou < (plus petite que) avec des valeurs négatives\nAjouté : l'option \"default\" pour la surcharge peut désormais contenir le code de fonction javascript et les états supplémentaires à récupérer\nAjouté : \"Remplir l'esquisse\" et \"Remplir l'élément\" en fonction de la valeur supportant maintenant les dépassements de valeur\nAjouté : Vérification de version supprimée, car cela est déroutant, si l'utilisateur utilise le dépôt par défaut et Github a une nouvelle version BETA\nAjouté: Nouvelle ligne-end pour remplir le contour en fonction de la valeur ajoutée. Peut maintenant être rond, carré et cul\nAjouté : quelques corrections linguistiques",
        "it": "FIX: Override per il colore di confine e il colore di bordatura non sono stati correttamente applicati su rect o cerchio\nFIX: Se iframe definito dall'utente era troppo piccolo, l'animazione non è stata applicata\nFIX: Timer corretto per l'utilizzo di \"Line animazione durante l'avvio\" o \"Mostra la linea tra gli elementi solo\"\nAggiunto: Funzione rielaborata, per rilevare meglio i sovrascritti per > (più grande di) o < (più piccolo di) con valori negativi\nAggiunto: \"default\" opzione per override ora può contenere codice funzione javascript e stati aggiuntivi da prendere\nAggiunto: \"Fill contorno\" e \"Fill element\" secondo il valore ora sostenere overrides valore\nAggiunto: Version check rimosso, come questo è confusing, se l'utente utilizza il repository predefinito e Github ha una nuova versione BETA\nAggiunto: Nuovo line-end per il riempimento profilo secondo il valore aggiunto. Può ora essere rotondo, quadrato e culo\nAggiunto: Poche correzioni di lingua",
        "es": "FIX: La anulación para el color fronterizo y el color limítrofe no se aplicaron correctamente en el rect o círculo\nFIX: Si el iframe definido por el usuario era demasiado pequeño, no se aplicó la animación\nFIX: Timer corregido para usar \"Line de animación durante el inicio\" o \"Mostrar línea entre elementos solamente\"\nAñadido: Función reelaborada, para detectar mejor los overrides para √≥ (más alto que) o י (más pequeño que) con valores negativos\nAñadido: opción \"default\" para override ahora puede contener código de función javascript y estados adicionales para ser capturados\nAñadido: \"Contorno de archivo\" y \"Elemento de archivo\" de acuerdo al valor de ahora soporte anula el valor\nAñadido: Revisión de la versión eliminada, ya que esto es confuso, si el usuario utiliza el repositorio predeterminado y Github tiene una nueva versión BETA\nAñadido: New line-end for fill outlined according to value added. Ahora puede ser redondo, cuadrado y trasero\nAñadido: Pocas correcciones de idiomas",
        "pl": "FIX: Nadwyżka na kolor graniczny i kolor graniczny nie były prawidłowo stosowane na rect lub okrąg\nFIX: Jeśli iframe zdefiniowany przez użytkownika był zbyt mały, animacja nie została zastosowana\nFIX: Czas skorygowany o użycie \"animacji linii podczas uruchamiania\" lub \"Pokaż linię tylko pomiędzy elementami\"\nDodano: Funkcja przerobiona, aby lepiej wykryć przekroczenia dla > (większe niż) lub < (mniejsze niż) o wartościach ujemnych\nDodano: opcja \"domyślna\" może teraz zawierać kod funkcji javascript i dodatkowe stany do pobrania\nDodano: \"Obrys napełnienia\" i \"Element napełnienia\" w zależności od wartości\nDodano: Version check usunięty, ponieważ jest to mylące, jeśli użytkownik używa domyślnego repozytorium i Github ma nową wersję BETA\nDodano: Nowy lineend do wypełnienia kontur według wartości dodanej. Może być teraz okrągłe, kwadratowe i tyłek\nDodano: Kilka poprawek językowych",
        "uk": "FIX: Надмір для бордюрного кольору і бордюрногобарвлення не вірно наноситься на прямокутну або коло\nFIX: Якщо користувацький iframe був занадто малим, анімація не була застосована\nFIX: Таймер скоригований для використання \"Ліну анімацію під час запуску\" або \"Показати лінію між елементами тільки\"\nДодано: Перероблену функцію, щоб краще виявити перенапруження для > (більше) або < (менше ніж) з негативними значеннями\nДодано: \"default\" параметр for override тепер може містити код функції javascript та додаткові стани, щоб бути fetched\nДодано: \"Філл контур\" і \"Філл елемент\" відповідно до значення тепер підтримка значення перенаречених\nДодано: Перевірити версію видалено, так як це суперечать, якщо користувач використовує репозиторію за замовчуванням і Github має нову версію BETA\nДодано: Новий рядок-end для заповнення за доданою вартістю. Може зараз бути круглий, квадрат і бат\nДодано: Корекції мови Few",
        "zh-cn": "FIX: 边框颜色和边框颜色的覆盖没有正确应用在矩形或圆上\nFIX: 如果用户定义的iframe太小, 动画没有应用\nFIX:因使用\"启动时的线性动画\"或\"仅在元素间显示线\"而修正的计时器\n添加: 重修函数,以更好地检测带有负值的 > (大于) 或 < (小于) 的覆盖\n添加: 用于覆盖的“ 默认” 选项现在可以包含javascript函数代码和要获取的额外状态\n添加 : “ Fill 大纲” 和 “ Fill 元素” , 以现在支持值的值覆盖\n添加: 版本检查已删除, 因为这令人困惑, 如果用户使用默认寄存器, 而 Github 有一个新的 BETA 版本\n添加:根据增加值新建填充大纲的行尾. 现在可以是圆的,方的和屁股\n添加:语言更正很少"
      },
      "0.7.4": {
        "en": "FIX: Switching on/off on some designs did not work correctly\nFIX: Calculation from W to kW was overwriting user defined unit\nAdded: New link to Wiki - now hosting on own server with translateable option\nAdded: Function to draw lines now supports better alignment, if source and destination element are on the same x/y-axis",
        "de": "FIX: Ein-/Ausschalten einiger Designs funktionierte nicht korrekt\nFIX: Die Berechnung von W auf kW war überschreibende Benutzereinheit\nHinzugefügt: Neuer Link zu Wiki - jetzt Hosting auf eigenen Server mit übersetzbarer Option\nHinzugefügt: Funktion zu ziehen Linien unterstützt nun eine bessere Ausrichtung, wenn Quell- und Zielelement auf der gleichen x/y-Achse sind",
        "ru": "FIX: включение/выключение некоторых конструкций не работает правильно\nFIX: расчет от W до kW был перезаписыванием определяемого пользователем блока\nДобавлено: Новая ссылка на Wiki - теперь хостинг на собственном сервере с возможностью перевода\nФункция рисования линий теперь поддерживает лучшее выравнивание, если элемент источника и назначения находится на одной оси x/y",
        "pt": "FIX: Ligar/desligar em alguns projetos não funcionou corretamente\nCORREÇÃO: Cálculo de W a kW foi sobrescrever unidade definida pelo usuário\nAdicionado: Novo link para Wiki - agora hospedando em próprio servidor com opção traduzível\nAdicionado: Função para desenhar linhas agora suporta melhor alinhamento, se fonte e elemento de destino estão no mesmo x/y-axis",
        "nl": "FIX: In-/uitschakelen van sommige ontwerpen werkte niet goed\nFIX: Berekening van W naar kW was de door de gebruiker gedefinieerde eenheid overschrijven\nToegevoegd: Nieuwe link naar Wiki - nu hosting op eigen server met vertaalbare optie\nToegevoegd: Functie om lijnen te tekenen ondersteunt nu betere uitlijning, als bron- en doelelement op dezelfde x/y-as staan",
        "fr": "FIX: L'activation/arrêt de certains modèles n'a pas fonctionné correctement\nFIX: Le calcul de W à kW était l'unité définie par l'utilisateur d'écrasement\nAjouté : Nouveau lien vers Wiki - maintenant hébergement sur son propre serveur avec option traduisable\nAjouté : La fonction de tracer des lignes prend désormais en charge un meilleur alignement, si la source et l'élément de destination sont sur le même axe x/y",
        "it": "FIX: Accendere/disattivare alcuni disegni non funzionava correttamente\nFIX: Calcolo da W a kW era sovrascrittura unità definita dall'utente\nAggiunto: Nuovo link a Wiki - ora hosting su proprio server con opzione traducibile\nAggiunto: La funzione per disegnare le linee ora supporta un migliore allineamento, se l'elemento sorgente e di destinazione sono sulla stessa x/y-assis",
        "es": "FIX: El encendido/apagado en algunos diseños no funcionó correctamente\nFIX: Cálculo de W a kW fue unidad definida por el usuario sobreescritura\nAñadido: Nuevo enlace a Wiki - ahora hospedaje en servidor propio con opción traducible\nAñadido: Función para dibujar líneas ahora soporta una mejor alineación, si el elemento fuente y destino están en el mismo eje x/y",
        "pl": "FIX: Włączenie / wyłączenie niektórych projektów nie działało prawidłowo\nFIX: Obliczanie od W do kW było nadpisanie jednostki użytkownika\nDodano: Nowy link do Wiki - teraz hosting na własnym serwerze z możliwością przeniesienia\nDodano: Funkcja rysowania linii obsługuje teraz lepsze ustawienie, jeśli element źródłowy i docelowy są na tej samej osi x / y-",
        "uk": "FIX: Перемикання/вимкнення на деяких конструкціях не працює правильно\nFIX: Розрахунок від W до кВт було перезапису певного блоку користувача\nДодано: Нове посилання на Вікі - тепер хостинг на власних серверах з можливістю переведення\nДодано: Функція для малювання ліній тепер підтримує краще вирівнювання, якщо джерело та елемент призначення на тій же x/y-вісі",
        "zh-cn": "FIX: 打开/关闭一些设计没有正确工作\nFIX: 从W到kW的计算是覆盖用户定义的单位\n添加: 与 Wiki 新链接 - 现在在可翻译选项的服务器上托管\n添加: 如果源元素和目的元素在同一x/y轴上, 绘制线条的函数支持更好的对齐"
      }
    },
    "titleLang": {
      "en": "Energiefluss - erweitert",
      "de": "Energiefluss - erweitert",
      "ru": "Поток энергии - erweitert",
      "pt": "Fluxo de energia - erweitert",
      "nl": "Energiestroom - uitgesteld",
      "fr": "Flux énergétique - étendu",
      "it": "Flusso di energia - esteso",
      "es": "Flujo de energía - ampliado",
      "pl": "Przepływ energii - rozwinięty",
      "uk": "Energiefluss - erweitert",
      "zh-cn": "能量流 - 延伸"
    },
    "desc": {
      "en": "This adapter provides a dynamic and animated visualization of energy flows for all connected elements in your smart home. It supports sources like photovoltaics, storage systems (batteries), household consumption, grid import/export, electric vehicle charging, and other energy-consuming or generating devices. Each flow is represented with clear bi-directional lines, animation dots and real-time values, allowing you to easily monitor and analyze energy distribution. You can customize icons, colors, and layout, and even use formulas to calculate derived values, giving you a flexible and fully interactive energy management dashboard.",
      "de": "Dieser Adapter bietet eine dynamische und animierte Visualisierung der Energieflüsse für alle angeschlossenen Elemente in Ihrem Smart Home. Es unterstützt Quellen wie Photovoltaik, Speichersysteme (Batterien), Haushaltsverbrauch, Netzimport/-export, Laden von Elektrofahrzeugen und andere energieverbrauchende oder erzeugende Geräte. Jeder Fluss wird durch klare bidirektionale Linien, Animationspunkte und Echtzeitwerte dargestellt, sodass Sie die Energieverteilung einfach überwachen und analysieren können. Sie können Symbole, Farben und Layout anpassen und sogar Formeln verwenden, um abgeleitete Werte zu berechnen, wodurch Sie ein flexibles und vollständig interaktives Energiemanagement-Dashboard erhalten.",
      "ru": "Этот адаптер обеспечивает динамическую и анимированную визуализацию потоков энергии для всех подключенных элементов вашего умного дома. Он поддерживает такие источники, как фотоэлектрические элементы, системы хранения (батареи), бытовое потребление, импорт/экспорт сети, зарядка электромобилей и другие энергопотребляющие или генерирующие устройства. Каждый поток представлен четкими двунаправленными линиями, анимационными точками и значениями в реальном времени, что позволяет легко отслеживать и анализировать распределение энергии. Вы можете настроить значки, цвета и макет и даже использовать формулы для расчета производных значений, предоставляя вам гибкую и полностью интерактивную панель управления энергопотреблением.",
      "pt": "Este adaptador fornece uma visualização dinâmica e animada dos fluxos de energia para todos os elementos conectados na sua casa inteligente. Suporta fontes como energia fotovoltaica, sistemas de armazenamento (baterias), consumo doméstico, importação/exportação de rede, carregamento de veículos elétricos e outros dispositivos consumidores ou geradores de energia. Cada fluxo é representado com linhas bidirecionais claras, pontos de animação e valores em tempo real, permitindo monitorar e analisar facilmente a distribuição de energia. Você pode personalizar ícones, cores e layout, e até mesmo usar fórmulas para calcular valores derivados, proporcionando um painel de gerenciamento de energia flexível e totalmente interativo.",
      "nl": "Deze adapter zorgt voor een dynamische en geanimeerde visualisatie van energiestromen voor alle aangesloten elementen in uw slimme huis. Het ondersteunt bronnen zoals fotovoltaïsche energie, opslagsystemen (batterijen), huishoudelijk verbruik, import/export van het elektriciteitsnet, het opladen van elektrische voertuigen en andere energieverbruikende of opwekkende apparaten. Elke stroom wordt weergegeven met duidelijke bidirectionele lijnen, animatiepunten en realtime waarden, zodat u de energieverdeling eenvoudig kunt volgen en analyseren. U kunt pictogrammen, kleuren en lay-out aanpassen en zelfs formules gebruiken om afgeleide waarden te berekenen, waardoor u een flexibel en volledig interactief dashboard voor energiebeheer krijgt.",
      "fr": "Cet adaptateur offre une visualisation dynamique et animée des flux énergétiques pour tous les éléments connectés de votre maison intelligente. Il prend en charge des sources telles que le photovoltaïque, les systèmes de stockage (batteries), la consommation domestique, l’importation/exportation du réseau, la recharge des véhicules électriques et d’autres dispositifs consommateurs ou générateurs d’énergie. Chaque flux est représenté par des lignes bidirectionnelles claires, des points d'animation et des valeurs en temps réel, vous permettant de surveiller et d'analyser facilement la distribution d'énergie. Vous pouvez personnaliser les icônes, les couleurs et la disposition, et même utiliser des formules pour calculer les valeurs dérivées, vous offrant ainsi un tableau de bord de gestion de l'énergie flexible et entièrement interactif.",
      "it": "Questo adattatore fornisce una visualizzazione dinamica e animata dei flussi di energia per tutti gli elementi collegati nella tua casa intelligente. Supporta fonti come fotovoltaico, sistemi di accumulo (batterie), consumo domestico, importazione/esportazione di rete, ricarica di veicoli elettrici e altri dispositivi che consumano o generano energia. Ogni flusso è rappresentato con chiare linee bidirezionali, punti di animazione e valori in tempo reale, consentendo di monitorare e analizzare facilmente la distribuzione dell'energia. Puoi personalizzare icone, colori e layout e persino utilizzare formule per calcolare i valori derivati, offrendoti un dashboard di gestione dell'energia flessibile e completamente interattivo.",
      "es": "Este adaptador proporciona una visualización dinámica y animada de los flujos de energía de todos los elementos conectados en su hogar inteligente. Admite fuentes como energía fotovoltaica, sistemas de almacenamiento (baterías), consumo doméstico, importación/exportación de redes, carga de vehículos eléctricos y otros dispositivos que consumen o generan energía. Cada flujo se representa con líneas bidireccionales claras, puntos de animación y valores en tiempo real, lo que le permite monitorear y analizar fácilmente la distribución de energía. Puede personalizar íconos, colores y diseño, e incluso usar fórmulas para calcular valores derivados, lo que le brinda un panel de administración de energía flexible y totalmente interactivo.",
      "pl": "Adapter ten zapewnia dynamiczną i animowaną wizualizację przepływów energii dla wszystkich podłączonych elementów Twojego inteligentnego domu. Obsługuje źródła takie jak fotowoltaika, systemy magazynowania (baterie), zużycie w gospodarstwach domowych, import/eksport sieci, ładowanie pojazdów elektrycznych i inne urządzenia zużywające lub generujące energię. Każdy przepływ jest reprezentowany za pomocą wyraźnych dwukierunkowych linii, animowanych kropek i wartości w czasie rzeczywistym, co pozwala na łatwe monitorowanie i analizowanie dystrybucji energii. Możesz dostosować ikony, kolory i układ, a nawet używać formuł do obliczania wartości pochodnych, tworząc elastyczny i w pełni interaktywny pulpit zarządzania energią.",
      "uk": "Цей адаптер забезпечує динамічну та анімовану візуалізацію потоків енергії для всіх підключених елементів у вашому розумному домі. Він підтримує такі джерела, як фотоелектричні пристрої, системи зберігання (акумулятори), побутове споживання, імпорт/експорт мережі, зарядка електромобілів та інші енергоспоживаючі або генеруючі пристрої. Кожен потік представлений чіткими двонаправленими лініями, точками анімації та значеннями в реальному часі, що дозволяє легко контролювати та аналізувати розподіл енергії. Ви можете налаштувати піктограми, кольори та макет і навіть використовувати формули для розрахунку похідних значень, надаючи вам гнучку та повністю інтерактивну інформаційну панель керування енергією.",
      "zh-cn": "该适配器为智能家居中所有连接的元素提供能量流的动态和动画可视化。它支持光伏、存储系统（电池）、家庭消费、电网进出口、电动汽车充电以及其他能源消耗或发电设备等来源。每个流量都用清晰的双向线、动画点和实时值表示，让您轻松监控和分析能量分布。您可以自定义图标、颜色和布局，甚至使用公式计算派生值，为您提供灵活且完全交互式的能源管理仪表板。"
    },
    "authors": [
      "SKB <info@skb-web.de>"
    ],
    "keywords": [
      "energy",
      "energy-flow",
      "energiefluss",
      "photovoltaic",
      "solar",
      "battery",
      "ev",
      "VIS",
      "visualization",
      "dashboard",
      "diagram"
    ],
    "platform": "Javascript/Node.js",
    "icon": "energiefluss-erweitert.png",
    "enabled": true,
    "localLinks": {
      "_default": "%web_protocol%://%ip%:%web_port%/energiefluss-erweitert/index.html?instance=%instance%"
    },
    "extIcon": "https://raw.githubusercontent.com/SKB-CGN/ioBroker.energiefluss-erweitert/main/admin/energiefluss-erweitert.png",
    "readme": "https://github.com/SKB-CGN/ioBroker.energiefluss-erweitert/blob/main/README.md",
    "loglevel": "info",
    "webExtension": "lib/web.js",
    "mode": "daemon",
    "tier": 3,
    "type": "visualization",
    "compact": true,
    "connectionType": "local",
    "dataSource": "assumption",
    "welcomeScreenPro": [
      {
        "link": "energiefluss-erweitert/",
        "name": "energiefluss-erweitert",
        "img": "energiefluss-erweitert/img/icons/android/android-launchericon-96-96.png",
        "color": "#538ea3",
        "order": 0
      }
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "adminUI": {
      "config": "materialize"
    },
    "restartAdapters": [
      "vis",
      "vis-2"
    ],
    "dependencies": [
      {
        "js-controller": ">=6.0.11",
        "web": ">=6.1.10"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ],
    "dataFolder": "energiefluss-erweitert.%INSTANCE%",
    "messagebox": true
  },
  "protectedNative": [
    "password"
  ],
  "encryptedNative": [
    "password"
  ],
  "native": {
    "webInstance": "*",
    "password": ""
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "configuration",
      "type": "state",
      "common": {
        "name": {
          "en": "JSON Configuration of the elements",
          "de": "JSON Konfiguration der Elemente",
          "ru": "JSON Конфигурация элементов",
          "pt": "JSON Configuração dos elementos",
          "nl": "JSON-configuratie van de elementen",
          "fr": "JSON Configuration des éléments",
          "it": "Configurazione JSON degli elementi",
          "es": "Configuración JSON de los elementos",
          "pl": "Konfiguracja JSON elementów",
          "uk": "JSON Конфігурація елементів",
          "zh-cn": "JSON Configuration of the elements"
        },
        "type": "json",
        "role": "state",
        "read": true,
        "write": false,
        "def": "{}"
      },
      "native": {}
    },
    {
      "_id": "data",
      "type": "state",
      "common": {
        "name": {
          "en": "Data for HTML Output",
          "de": "Daten für die HTML-Ausgabe",
          "ru": "Данные для вывода в формате HTML",
          "pt": "Dados para saída HTML",
          "nl": "Gegevens voor HTML-uitvoer",
          "fr": "Données pour la sortie HTML",
          "it": "Dati per l'output HTML",
          "es": "Datos para la salida HTML",
          "pl": "Dane dla wyjścia HTML",
          "uk": "Дані для виводу в HTML",
          "zh-cn": "Data for HTML Output"
        },
        "type": "json",
        "role": "state",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "calculation",
      "type": "channel",
      "common": {
        "name": {
          "en": "Calculations provided by the adapter",
          "de": "Vom Adapter bereitgestellte Berechnungen",
          "ru": "Расчеты, предоставленные адаптером",
          "pt": "Cálculos fornecidos pelo adaptador",
          "nl": "Berekeningen geleverd door de adapter",
          "fr": "Calculs fournis par l'adaptateur",
          "it": "Calcoli forniti dall'adattatore",
          "es": "Cálculos proporcionados por el adaptador",
          "pl": "Obliczenia dostarczone przez adapter",
          "uk": "Розрахунки надані адаптером",
          "zh-cn": "Calculations provided by the adapter"
        }
      },
      "native": {}
    },
    {
      "_id": "calculation.autarky",
      "type": "channel",
      "common": {
        "name": {
          "en": "Autarky",
          "de": "Autarkie",
          "ru": "Автаркия",
          "pt": "Autarquia",
          "nl": "Autarkie",
          "fr": "L'autarcie",
          "it": "Autarchia",
          "es": "Autarquía",
          "pl": "Autarkia",
          "uk": "Автаркія",
          "zh-cn": "Autarky"
        }
      },
      "native": {}
    },
    {
      "_id": "calculation.battery",
      "type": "channel",
      "common": {
        "name": {
          "en": "Battery",
          "de": "Batterie",
          "ru": "Аккумулятор",
          "pt": "Bateria",
          "nl": "Batterij",
          "fr": "Batterie",
          "it": "Batteria",
          "es": "Batería",
          "pl": "Bateria",
          "uk": "Батарея",
          "zh-cn": "Battery"
        }
      },
      "native": {}
    },
    {
      "_id": "calculation.consumption",
      "type": "channel",
      "common": {
        "name": {
          "en": "Consumption",
          "de": "Verbrauch",
          "ru": "Потребление",
          "pt": "Consumo",
          "nl": "Verbruik",
          "fr": "Consommation",
          "it": "Consumo",
          "es": "Consumo",
          "pl": "Zużycie",
          "uk": "Споживання",
          "zh-cn": "Consumption"
        }
      },
      "native": {}
    },
    {
      "_id": "calculation.production",
      "type": "channel",
      "common": {
        "name": {
          "en": "Production",
          "de": "Produktion",
          "ru": "Производство",
          "pt": "Produção",
          "nl": "Productie",
          "fr": "Production",
          "it": "Produzione",
          "es": "Producción",
          "pl": "Produkcja",
          "uk": "Виробництво",
          "zh-cn": "Production"
        }
      },
      "native": {}
    },
    {
      "_id": "calculation.elements",
      "type": "channel",
      "common": {
        "name": {
          "en": "Additions and Subtractions of elements",
          "de": "Additionen und Subtraktionen von Elementen",
          "ru": "Сложение и вычитание элементов",
          "pt": "Adições e subtracções de elementos",
          "nl": "Optellen en aftrekken van elementen",
          "fr": "Additions et soustractions d'éléments",
          "it": "Addizioni e sottrazioni di elementi",
          "es": "Sumas y restas de elementos",
          "pl": "Dodawanie i odejmowanie elementów",
          "uk": "Додавання та віднімання елементів",
          "zh-cn": "Additions and Subtractions of elements"
        }
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.remaining",
      "type": "state",
      "common": {
        "name": {
          "en": "Remaining Time of the battery",
          "de": "Verbleibende Zeit des Akkus",
          "ru": "Остаточное время работы аккумулятора",
          "pt": "Tempo restante da bateria",
          "nl": "Resterende tijd van de batterij",
          "fr": "Durée restante de la batterie",
          "it": "Tempo residuo della batteria",
          "es": "Tiempo restante de la batería",
          "pl": "Pozostały czas pracy akumulatora",
          "uk": "Час, що залишився від батареї",
          "zh-cn": "Remaining Time of the battery"
        },
        "type": "string",
        "role": "state",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.remaining_target",
      "type": "state",
      "common": {
        "name": {
          "en": "Target of the remaining Time of the battery",
          "de": "Ziel der verbleibenden Zeit des Akkus",
          "ru": "Индикатор оставшегося времени работы аккумулятора",
          "pt": "Objetivo do tempo restante da bateria",
          "nl": "Doel van de resterende tijd van de batterij",
          "fr": "Objectif du temps restant de la batterie",
          "it": "Obiettivo del tempo residuo della batteria",
          "es": "Objetivo del tiempo restante de la batería",
          "pl": "Cel pozostałego czasu pracy akumulatora",
          "uk": "Цільовий час роботи акумулятора, що залишився",
          "zh-cn": "Target of the remaining Time of the battery"
        },
        "type": "number",
        "role": "value.time",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.remaining_target_DT",
      "type": "state",
      "common": {
        "name": {
          "en": "Target of the remaining Time of the battery (Date&Time)",
          "de": "Ziel der verbleibenden Zeit der Batterie (Datum&Uhrzeit)",
          "ru": "Задание оставшегося времени работы аккумулятора (Дата и время)",
          "pt": "Objetivo do tempo restante da bateria (Data e Hora)",
          "nl": "Doel van de resterende tijd van de batterij (Datum&Tijd)",
          "fr": "Objectif du temps restant de la batterie (date et heure)",
          "it": "Obiettivo del tempo rimanente della batteria (data e ora)",
          "es": "Objetivo del tiempo restante de la batería (Fecha&Hora)",
          "pl": "Cel pozostałego czasu pracy akumulatora (data i godzina)",
          "uk": "Цільовий час, що залишився від батареї (Дата і час)",
          "zh-cn": "Target of the remaining Time of the battery (Date&Time)"
        },
        "type": "string",
        "role": "value",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.charging_grid",
      "type": "state",
      "common": {
        "name": {
          "en": "Current Charging via Grid",
          "de": "Stromaufladung über das Netz",
          "ru": "Текущая зарядка через сеть",
          "pt": "Carregamento atual através da rede",
          "nl": "Stroom Opladen via Net",
          "fr": "Chargement actuel par le réseau",
          "it": "Ricarica di corrente tramite rete",
          "es": "Carga actual a través de la red",
          "pl": "Bieżące ładowanie przez sieć",
          "uk": "Зарядка від мережі",
          "zh-cn": "Current Charging via Grid"
        },
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "W"
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.charging_solar",
      "type": "state",
      "common": {
        "name": {
          "en": "Current Charging via Solar",
          "de": "Stromaufladung über Solar",
          "ru": "Зарядка током от солнечной батареи",
          "pt": "Carregamento de corrente através de energia solar",
          "nl": "Stroom opladen via zonne-energie",
          "fr": "Chargement du courant par voie solaire",
          "it": "Ricarica di corrente tramite energia solare",
          "es": "Carga de corriente mediante energía solar",
          "pl": "Ładowanie prądem przez baterię słoneczną",
          "uk": "Поточна зарядка через сонячну батарею",
          "zh-cn": "Current Charging via Solar"
        },
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "W"
      },
      "native": {}
    },
    {
      "_id": "calculation.battery.remaining_energy",
      "type": "state",
      "common": {
        "name": {
          "en": "Available power in battery",
          "de": "Verfügbare Leistung der Batterie",
          "ru": "Доступная мощность батареи",
          "pt": "Potência disponível na bateria",
          "nl": "Beschikbaar vermogen in batterij",
          "fr": "Puissance disponible dans la batterie",
          "it": "Potenza disponibile nella batteria",
          "es": "Energía disponible en la batería",
          "pl": "Dostępna moc w akumulatorze",
          "uk": "Доступна потужність в акумуляторі",
          "zh-cn": "Available power in battery"
        },
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "Wh"
      },
      "native": {}
    },
    {
      "_id": "calculation.consumption.consumption",
      "type": "state",
      "common": {
        "name": {
          "en": "Current consumption",
          "de": "Stromverbrauch",
          "ru": "Текущее потребление",
          "pt": "Consumo atual",
          "nl": "Huidige consumptie",
          "fr": "Consommation de courant",
          "it": "Consumo di corrente",
          "es": "Consumo actual",
          "pl": "Pobór prądu",
          "uk": "Поточне споживання",
          "zh-cn": "Current consumption"
        },
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "W"
      },
      "native": {}
    },
    {
      "_id": "calculation.production.production",
      "type": "state",
      "common": {
        "name": {
          "en": "Current production",
          "de": "Laufende Produktion",
          "ru": "Текущее производство",
          "pt": "Produção atual",
          "nl": "Huidige productie",
          "fr": "Production actuelle",
          "it": "Produzione attuale",
          "es": "Producción actual",
          "pl": "Bieżąca produkcja",
          "uk": "Поточне виробництво",
          "zh-cn": "Current production"
        },
        "type": "number",
        "role": "value.power",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "W"
      },
      "native": {}
    },
    {
      "_id": "calculation.autarky.autarky",
      "type": "state",
      "common": {
        "name": {
          "en": "Current autarky",
          "de": "Aktuelle Autarkie",
          "ru": "Нынешняя автаркия",
          "pt": "Autarquia atual",
          "nl": "Huidige autarkie",
          "fr": "Autarcie actuelle",
          "it": "L'autarchia attuale",
          "es": "Autarquía actual",
          "pl": "Obecna autarkia",
          "uk": "Нинішня автаркія",
          "zh-cn": "Current autarky"
        },
        "type": "number",
        "role": "value",
        "read": true,
        "write": false,
        "def": 0,
        "unit": "%"
      },
      "native": {}
    },
    {
      "_id": "",
      "type": "meta",
      "common": {
        "name": {
          "en": "Storage for energiefluss-erweitert",
          "de": "Speicher für energiefluss-erweitert",
          "ru": "Хранилище для энергосберегающих устройств",
          "pt": "Armazenamento para energiefluss-erweitert",
          "nl": "Opslag voor energiefluss-erweitert",
          "fr": "Stockage pour energiefluss-erweitert",
          "it": "Stoccaggio per energiefluss-erweitert",
          "es": "Almacenamiento para energiefluss-erweitert",
          "pl": "Przechowywanie dla energiefluss-erweitert",
          "uk": "Сховище для зберігання енергії",
          "zh-cn": "Storage for energiefluss-erweitert"
        },
        "type": "meta.user"
      },
      "native": {}
    }
  ]
}